package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/8.
 */

public class ChinaHistoryCultureDetail implements Serializable {


    /**
     * code : 200
     * china_History_Culture_Detail : {"id":1,"title":"上古诸神简介","img_url":"http://www.todayonhistory.com/uploadfile/2015/1006/20151006110358645.jpg","content":"　　创世神：盘古。\n　　传说原本宇宙是个象鸡蛋一样的混沌球，盘古就生长在其中，一日长大成人，觉得不舒服，于是就舒展手脚，\u201c哗啦\u201d一下就把混沌分开了，其分为两气，清轻者上浮为天，浊厚者下积为地，但在有些地方海连着，所以盘古就手托天，脚踩地，拼命让身体长大，把天地完全分开，天，每天升高一丈；地，每\n天加厚一丈。盘古的身子也每天伸长一丈。这样又经过\n一万八千年，天极高了，地极厚了，盘古的身子也极长了。但盘古的寿命也到头了，所以在完成开天辟地的任务厚就死了，但在临死前，他运用最后的神力创造了世界万物：\n呼出的气成了风和云，声音成了雷霆，\n左眼变成太阳，右眼变成月亮，四肢五体变成大地的四极和五方的名山，血液变成江河，筋脉变成道路，肌肤\n变成田土，头发和髭须变成天上的星星，皮肤上的毛变成草和树木，牙齿和骨头变成金属的矿物和岩石，精\n液和骨髓变成珍珠和美玉，流的汗变成雨，其精魂则化为神灵\u2026\u2026盘古用他的身体化成世界万物。与其他国家的创世神的威严不同，盘古给人是一个默默奉献的人的形象。\n　　阴阳二神：伏羲（阳神\n父神）、女娲（阴神\n母神）\n　　伏羲又称太昊，太暤，庖牺氏。相传伏羲的母亲华胥氏外出，在雷泽中无意中看到一个特大的脚印，好奇的华胥用她的足迹丈量了大人的足迹，不知不觉感应受孕，怀胎十二年后，伏羲降生了。伏羲的功绩有：1、始作八卦。2、发明渔猎工具。3、制嫁娶之礼。4、造书契。5、创历法。6、制琴作乐。7、其他功绩：立占筮之法，创立占卜学；立九部，设六佐，分部管理部族事务等。总之，上古文明的曙光，在伏羲时代就开始显露出来了。所以伏羲后来被尊为阳神或父神，做了东方的天帝管理着东方青土树木的原野一万二千里的地方，是春天的主神。\n　　女娲，据说天地开辟以后，大地上没有人类的踪迹。大母神女娲用黄土，仿照自己映在水中的形貌，捏成一个个小人。这些泥人一放到地面上，就有了生命，女娲给他们取名叫做\u201c人\u201d。于是大地上到处都有了人类活动的踪迹。女娲还使男女相配，叫他们自己生育后代，神话中女娲也是最早的婚姻之神。后来由于共工和颛顼争当天帝失败而怒触天柱不周山，半边天空坍塌下来，露出一个个可怕的黑窟窿，地上也也出现一道道巨大的裂口，山林燃起炎炎烈火，地底喷涌出滔滔洪水。女娲见人类遭受这样惨烈的灾祸，就全力补修天地。她先用五彩石，把天上的窟窿补好。又杀了一只大龟，砍下它的四只脚竖在大地四方，把天空支撑起来，用芦苇灰阻塞了横流的洪水。从此灾难得以平息，人类得到拯救。\n　　另据传说，伏羲和女娲是一对夫妻，她和伏羲结合以后，两人分别成了汉族的\u201c人祖爷\u201d和\u201c人祖奶\u201d。\n　　五方天帝\n　　东方天帝：太昊（一说为帝俊），是东方的主神，太阳的父亲。\n　　西方天帝：少昊金天氏，冶金和刑杀之神，\n主宰西土十二万里天地。\n　　南方天帝：炎帝神农氏，火神和医药之神，与黄帝作战失败后，退居南方。\n　　北方天帝：颛顼，黄帝之孙，水神，他绝地天通，阻止了人神的自由来往，又打败共工当上了北方天帝。\n　　中央天帝：黄帝轩辕氏，为华夏植祖，他先后打败炎第和蚩尤，成为了四方之主，最后\n在鼎湖乘龙登天，安坐在天廷的中央，作了中央的天帝。其他四方，东方是太昊；南方是炎帝；西方是少昊；北方是颛顼。黄帝和这四方天帝的确立，一幅完整的神国组织图便这样绘制成功了。\n　　昊天上帝：由五方天帝发展而来，主要是因为中国逐渐确立起专制王权，所以反映在神话中就把原来五个天帝合并为一个至高无上的全能统治者。昊天上帝在商朝时称为帝俊，商王认为帝俊是他们的祖先神，是全能之神，所以人民应该接受帝俊的子孙商王的统治，不能有二心，否则就会受到天罚。到西周则干脆就称为天或上帝，周王与商王一样，自称是\u201c天子\u201d，取义为\u201c天之元子\u201d，其目的实际与商王一样。\n　　天后：西王母，她原本的形象是掌管瘟疫刑罚的凶神，虎齿而善啸，蓬发戴胜。但到后来竟成\u201c可年三十许，修短得中，天姿掩蔼，容颜绝世\u201d的女仙，地位也不断上升，最后成为昊天上帝的配偶，天上的第一夫人，居住在瑶池胜境。\n　　凶暴和战乱之神：蚩尤。在有关的文献记载中，蚩尤的形象是暴君和乱贼，是相当丑恶的。传说蚩尤兄弟八十一人，并兽身人语，铜头铁额，食沙石子，造立兵杖马戟大弩，威振天下。诛杀无道，不仁不慈。蚩尤作兵伐黄帝，帝乃令应龙攻之冀州之野，应龙畜水，蚩尤请风伯雨师纵大风雨。黄帝乃下天女日魃，雨止，遂杀蚩尤。虽然如此，但在汉族古代主要是把蚩尤作为英武的战神加以崇拜的。秦始皇、汉高祖都立祠祭奉蚩尤，把他作为战神、\u201c兵主\u201d，加以崇敬，以利战事。\n　　水神\n　　共工，北方水神，当初与颛顼争当北方天帝失败，共工发怒而撞倒了周山，使支撑苍天的大柱子折断了，拴著大地的绳子断了。天在西北方塌下来，因此日月星辰移向西北方；大地东南方沉下去，因此江河积水和尘埃全倾到东南方。\n　　应龙，黄帝部下，跟随黄帝讨伐蚩尤，黄帝派遣应龙到冀州原野去抵御他。应龙\n蓄积水,用水淹蚩尤。\n　　江神，长江之神\n　　河伯，黄河之神\n　　湘夫人，湘君，相传是舜的妃子娥皇和女英，死后为湘江之神。\n　　九天玄女，简称玄女，俗称九天玄女娘娘。原为中国古代神话中的女神，曾传授黄帝兵信神符，制伏蚩尤。后经道教增饰奉为女仙。\n　　火神\n　　燧人，又称燧皇，教人钻木取火，后与伏羲。神农并称三皇。\n　　炎帝，南方天帝，主火。\n　　祝融，南方火神，辅佐炎帝统治南方，后来又奉帝命杀鲧于羽郊。\n　　风神：风伯，曾助蚩尤攻打黄帝。\n　　雨神：雨师，与风伯一起攻打黄帝，阻击应龙。\n　　旱神：魃，当初蚩尤请风伯雨师，纵大风雨。黄帝乃下天女曰，雨止，遂杀蚩尤。魃不得复上，所居不雨。\n　　战神：刑天，刑天是与天帝对抗，失败后被断头仍不停止战斗的著名神话英雄。黄帝用强大的武力打败了炎帝，坐上了中央天帝的宝座，炎帝被迫退到南方。但炎帝的部下并不甘心失败，刑天发誓要与黄帝争夺神位。他左手握一面盾，右手拿一把斧，与天帝开始了一场激战。他们一直杀到常阳山地方，黄帝看准机会一剑向刑天脖颈砍去，刑天那颗巨大的头颅就被砍落下来。刑天见头被砍落，愈加震怒。他毫不示弱，以两只乳头当作眼睛，肚脐当作嘴巴，挥舞武器，继续呐喊战斗。刑天虽然失败了，但他不屈不挠，战斗到底的英雄精神常常为后人称颂。晋代大诗人陶渊明用\u201c刑天舞干戚，猛志固常在\u201d的诗句，盛赞这位断头英雄。\n　　力神：夸父。即夸峨氏，他立下宏愿，决心去追赶太阳，可是夸父最后因此而死了，他的两个儿子的力量也很大，大到能把太行和王屋二山搬走。\n　　射神：后羿，帝尧之时，天出十日，后羿引弓射下九日。\n　　太阳：东方天帝之子，为三足金乌，原本兄弟十人，后被后羿射死九个。\n　　月亮：嫦娥，后羿之妻，因误服仙药而升上月宫，后李商隐曾有诗感叹嫦娥：\u201c嫦娥应悔偷灵药，碧海青天夜夜心。\u201d\n　　文神：仓颉，他是黄帝的史官，黄帝统一华夏之后，感到用结绳的方法记事，满足不了要求，就命他的史官仓颉想办法，造字。于是，仓颉仔细观察各种事物的特征，譬如日、月、星、云、山、河、湖、海，以及各种飞禽走兽、应用器物，并按其特徵，画出图形，造出许多象形字来。仓颉把他造的这些象形字献给黄帝，黄帝非常高兴，立即召集九州酋长，让仓颉把造的这些字传授给他们，于是，这些象形字便开始应用起来。\n　　农神：后稷，是周的祖先，也是黄帝的曾孙帝喾的儿子，承继了姬姓。传说后稷的母亲姜原，是帝喾的元配皇后，有一次她到野外出游，见到了臣人的足迹而心生喜悦，就踩踏这些足迹，而后身动如怀孕一般，不久就生下了一个男孩。这孩子就是后来的后稷。后稷长大后出任尧的农官，教民稼穑，被后人尊为\u201c农神\u201d\n，赐姓姬，成为周族的先祖。\n　　狱神：皋陶，传说他是虞舜的一个掌管刑法的士(即监狱长)。他公正廉明，为官正直。后被尊为狱神。\n　　蚕神：传说中黄帝元妃，养蚕业的倡始者，被后世尊为蚕神。\n　　婚姻之神：月老，是我国神话传说中专管婚姻的媒神。\n关键词:\n上古\n上古诸神\n女娲\n"}
     */

    private int code;
    private ChinaHistoryCultureDetailBean china_History_Culture_Detail;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public ChinaHistoryCultureDetailBean getChina_History_Culture_Detail() {
        return china_History_Culture_Detail;
    }

    public void setChina_History_Culture_Detail(ChinaHistoryCultureDetailBean china_History_Culture_Detail) {
        this.china_History_Culture_Detail = china_History_Culture_Detail;
    }

    public static class ChinaHistoryCultureDetailBean implements Serializable {
        /**
         * id : 1
         * title : 上古诸神简介
         * img_url : http://www.todayonhistory.com/uploadfile/2015/1006/20151006110358645.jpg
         * content : 　　创世神：盘古。
         　　传说原本宇宙是个象鸡蛋一样的混沌球，盘古就生长在其中，一日长大成人，觉得不舒服，于是就舒展手脚，“哗啦”一下就把混沌分开了，其分为两气，清轻者上浮为天，浊厚者下积为地，但在有些地方海连着，所以盘古就手托天，脚踩地，拼命让身体长大，把天地完全分开，天，每天升高一丈；地，每
         天加厚一丈。盘古的身子也每天伸长一丈。这样又经过
         一万八千年，天极高了，地极厚了，盘古的身子也极长了。但盘古的寿命也到头了，所以在完成开天辟地的任务厚就死了，但在临死前，他运用最后的神力创造了世界万物：
         呼出的气成了风和云，声音成了雷霆，
         左眼变成太阳，右眼变成月亮，四肢五体变成大地的四极和五方的名山，血液变成江河，筋脉变成道路，肌肤
         变成田土，头发和髭须变成天上的星星，皮肤上的毛变成草和树木，牙齿和骨头变成金属的矿物和岩石，精
         液和骨髓变成珍珠和美玉，流的汗变成雨，其精魂则化为神灵……盘古用他的身体化成世界万物。与其他国家的创世神的威严不同，盘古给人是一个默默奉献的人的形象。
         　　阴阳二神：伏羲（阳神
         父神）、女娲（阴神
         母神）
         　　伏羲又称太昊，太暤，庖牺氏。相传伏羲的母亲华胥氏外出，在雷泽中无意中看到一个特大的脚印，好奇的华胥用她的足迹丈量了大人的足迹，不知不觉感应受孕，怀胎十二年后，伏羲降生了。伏羲的功绩有：1、始作八卦。2、发明渔猎工具。3、制嫁娶之礼。4、造书契。5、创历法。6、制琴作乐。7、其他功绩：立占筮之法，创立占卜学；立九部，设六佐，分部管理部族事务等。总之，上古文明的曙光，在伏羲时代就开始显露出来了。所以伏羲后来被尊为阳神或父神，做了东方的天帝管理着东方青土树木的原野一万二千里的地方，是春天的主神。
         　　女娲，据说天地开辟以后，大地上没有人类的踪迹。大母神女娲用黄土，仿照自己映在水中的形貌，捏成一个个小人。这些泥人一放到地面上，就有了生命，女娲给他们取名叫做“人”。于是大地上到处都有了人类活动的踪迹。女娲还使男女相配，叫他们自己生育后代，神话中女娲也是最早的婚姻之神。后来由于共工和颛顼争当天帝失败而怒触天柱不周山，半边天空坍塌下来，露出一个个可怕的黑窟窿，地上也也出现一道道巨大的裂口，山林燃起炎炎烈火，地底喷涌出滔滔洪水。女娲见人类遭受这样惨烈的灾祸，就全力补修天地。她先用五彩石，把天上的窟窿补好。又杀了一只大龟，砍下它的四只脚竖在大地四方，把天空支撑起来，用芦苇灰阻塞了横流的洪水。从此灾难得以平息，人类得到拯救。
         　　另据传说，伏羲和女娲是一对夫妻，她和伏羲结合以后，两人分别成了汉族的“人祖爷”和“人祖奶”。
         　　五方天帝
         　　东方天帝：太昊（一说为帝俊），是东方的主神，太阳的父亲。
         　　西方天帝：少昊金天氏，冶金和刑杀之神，
         主宰西土十二万里天地。
         　　南方天帝：炎帝神农氏，火神和医药之神，与黄帝作战失败后，退居南方。
         　　北方天帝：颛顼，黄帝之孙，水神，他绝地天通，阻止了人神的自由来往，又打败共工当上了北方天帝。
         　　中央天帝：黄帝轩辕氏，为华夏植祖，他先后打败炎第和蚩尤，成为了四方之主，最后
         在鼎湖乘龙登天，安坐在天廷的中央，作了中央的天帝。其他四方，东方是太昊；南方是炎帝；西方是少昊；北方是颛顼。黄帝和这四方天帝的确立，一幅完整的神国组织图便这样绘制成功了。
         　　昊天上帝：由五方天帝发展而来，主要是因为中国逐渐确立起专制王权，所以反映在神话中就把原来五个天帝合并为一个至高无上的全能统治者。昊天上帝在商朝时称为帝俊，商王认为帝俊是他们的祖先神，是全能之神，所以人民应该接受帝俊的子孙商王的统治，不能有二心，否则就会受到天罚。到西周则干脆就称为天或上帝，周王与商王一样，自称是“天子”，取义为“天之元子”，其目的实际与商王一样。
         　　天后：西王母，她原本的形象是掌管瘟疫刑罚的凶神，虎齿而善啸，蓬发戴胜。但到后来竟成“可年三十许，修短得中，天姿掩蔼，容颜绝世”的女仙，地位也不断上升，最后成为昊天上帝的配偶，天上的第一夫人，居住在瑶池胜境。
         　　凶暴和战乱之神：蚩尤。在有关的文献记载中，蚩尤的形象是暴君和乱贼，是相当丑恶的。传说蚩尤兄弟八十一人，并兽身人语，铜头铁额，食沙石子，造立兵杖马戟大弩，威振天下。诛杀无道，不仁不慈。蚩尤作兵伐黄帝，帝乃令应龙攻之冀州之野，应龙畜水，蚩尤请风伯雨师纵大风雨。黄帝乃下天女日魃，雨止，遂杀蚩尤。虽然如此，但在汉族古代主要是把蚩尤作为英武的战神加以崇拜的。秦始皇、汉高祖都立祠祭奉蚩尤，把他作为战神、“兵主”，加以崇敬，以利战事。
         　　水神
         　　共工，北方水神，当初与颛顼争当北方天帝失败，共工发怒而撞倒了周山，使支撑苍天的大柱子折断了，拴著大地的绳子断了。天在西北方塌下来，因此日月星辰移向西北方；大地东南方沉下去，因此江河积水和尘埃全倾到东南方。
         　　应龙，黄帝部下，跟随黄帝讨伐蚩尤，黄帝派遣应龙到冀州原野去抵御他。应龙
         蓄积水,用水淹蚩尤。
         　　江神，长江之神
         　　河伯，黄河之神
         　　湘夫人，湘君，相传是舜的妃子娥皇和女英，死后为湘江之神。
         　　九天玄女，简称玄女，俗称九天玄女娘娘。原为中国古代神话中的女神，曾传授黄帝兵信神符，制伏蚩尤。后经道教增饰奉为女仙。
         　　火神
         　　燧人，又称燧皇，教人钻木取火，后与伏羲。神农并称三皇。
         　　炎帝，南方天帝，主火。
         　　祝融，南方火神，辅佐炎帝统治南方，后来又奉帝命杀鲧于羽郊。
         　　风神：风伯，曾助蚩尤攻打黄帝。
         　　雨神：雨师，与风伯一起攻打黄帝，阻击应龙。
         　　旱神：魃，当初蚩尤请风伯雨师，纵大风雨。黄帝乃下天女曰，雨止，遂杀蚩尤。魃不得复上，所居不雨。
         　　战神：刑天，刑天是与天帝对抗，失败后被断头仍不停止战斗的著名神话英雄。黄帝用强大的武力打败了炎帝，坐上了中央天帝的宝座，炎帝被迫退到南方。但炎帝的部下并不甘心失败，刑天发誓要与黄帝争夺神位。他左手握一面盾，右手拿一把斧，与天帝开始了一场激战。他们一直杀到常阳山地方，黄帝看准机会一剑向刑天脖颈砍去，刑天那颗巨大的头颅就被砍落下来。刑天见头被砍落，愈加震怒。他毫不示弱，以两只乳头当作眼睛，肚脐当作嘴巴，挥舞武器，继续呐喊战斗。刑天虽然失败了，但他不屈不挠，战斗到底的英雄精神常常为后人称颂。晋代大诗人陶渊明用“刑天舞干戚，猛志固常在”的诗句，盛赞这位断头英雄。
         　　力神：夸父。即夸峨氏，他立下宏愿，决心去追赶太阳，可是夸父最后因此而死了，他的两个儿子的力量也很大，大到能把太行和王屋二山搬走。
         　　射神：后羿，帝尧之时，天出十日，后羿引弓射下九日。
         　　太阳：东方天帝之子，为三足金乌，原本兄弟十人，后被后羿射死九个。
         　　月亮：嫦娥，后羿之妻，因误服仙药而升上月宫，后李商隐曾有诗感叹嫦娥：“嫦娥应悔偷灵药，碧海青天夜夜心。”
         　　文神：仓颉，他是黄帝的史官，黄帝统一华夏之后，感到用结绳的方法记事，满足不了要求，就命他的史官仓颉想办法，造字。于是，仓颉仔细观察各种事物的特征，譬如日、月、星、云、山、河、湖、海，以及各种飞禽走兽、应用器物，并按其特徵，画出图形，造出许多象形字来。仓颉把他造的这些象形字献给黄帝，黄帝非常高兴，立即召集九州酋长，让仓颉把造的这些字传授给他们，于是，这些象形字便开始应用起来。
         　　农神：后稷，是周的祖先，也是黄帝的曾孙帝喾的儿子，承继了姬姓。传说后稷的母亲姜原，是帝喾的元配皇后，有一次她到野外出游，见到了臣人的足迹而心生喜悦，就踩踏这些足迹，而后身动如怀孕一般，不久就生下了一个男孩。这孩子就是后来的后稷。后稷长大后出任尧的农官，教民稼穑，被后人尊为“农神”
         ，赐姓姬，成为周族的先祖。
         　　狱神：皋陶，传说他是虞舜的一个掌管刑法的士(即监狱长)。他公正廉明，为官正直。后被尊为狱神。
         　　蚕神：传说中黄帝元妃，养蚕业的倡始者，被后世尊为蚕神。
         　　婚姻之神：月老，是我国神话传说中专管婚姻的媒神。
         关键词:
         上古
         上古诸神
         女娲

         */

        private int id;
        private String title;
        private String img_url;
        private String content;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getContent() {
            return content;
        }

        public void setContent(String content) {
            this.content = content;
        }

        @Override
        public String toString() {
            return "ChinaHistoryCultureDetailBean{" +
                    "id=" + id +
                    ", title='" + title + '\'' +
                    ", img_url='" + img_url + '\'' +
                    ", content='" + content + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "ChinaHistoryCultureDetail{" +
                "code=" + code +
                ", china_History_Culture_Detail=" + china_History_Culture_Detail +
                '}';
    }
}
