package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/9.
 */

public class ForeignHistoryDetail implements Serializable {


    /**
     * code : 200
     * foreign_History_Detail : {"id":6174,"title":"美国为二战征兵力花样多：海报、政策动员2000万人应征","author":"彼岸花开","time":"2016-07-21","img_url":"http://www.todayonhistory.com/uploadfile/2016/0721/20160721055938375.jpg","detail":"　　二战中，美国为了获得最后的胜利，采用了多种手段保证兵力充足，美国政府先后动员2000万人应征入伍，既有激奋人心的海报又有货真价实的政策。\n　　激奋人心的海报\n　　第二次世界大战中，美国政府先后动员2000万人应征入伍，为最终打败法西斯提供了充足的兵员保障。军史专家称，华盛顿综合运用多种征兵手段，既\u201c唱高调\u201d又给实惠，许多措施还惠及战后经济发展，可以说在战场以外又打了场胜仗。\n　　海报是各国政府在征兵时最常使用的宣传手段之一，美国也不例外。从第一次世界大战起，美国政府就为征兵海报设计了六大主题，其中爱国主义一直是\u201c主旋律\u201d。最有代表性的当属\u201c山姆大叔需要你\u201d海报。其实它在一战中就被广泛使用了，由于效果好，二战中美国政府继续使用它。画面中的山姆大叔以一个坚毅的父亲形象呈现，他用手指向你，配的广告语简单又直接\u2014\u2014\u201c我要你参加美国陆军\u201d!曾有人这样评价这幅海报：\u201c他直视你的灵魂，传递出荣誉与责任的信息。只要看上一眼，就足以让每一个热血男儿签约入伍\u201d。它也被称为\u201c有史以来最著名的宣传海报之一\u201d。\n　　\u201c珍珠港事件\u201d后，美国出现一大批煽动对日仇恨的海报，其中比较著名的一张画面是这样的：一个日本兵手里拎着一把手枪，背上背着一个裸体白人女性，而配发的文字称，\u201c这就是敌人\u201d。\n　　在这些海报的鼓舞下，美国年轻人纷纷响应号召穿上军装，其中不乏明星大腕。影坛巨星詹姆斯·史都华在1941年底加入陆军航空队，成为第一位应征入伍的大牌影星。二战中他还成为空战英雄，最后升至空军准将。曾主演《乱世佳人》的大腕克拉克·盖博也加入陆军航空队，他大多数时间在英国战斗。初出茅庐的导演亨利·方达则加入了美国海军，成为一名情报军官。体坛明星也不甘落后。\u201c珍珠港事件\u201d发生后不久，美国职棒联盟克利夫兰印第安人队的投手鲍勃·费勒就报名参军，是第一个上战场的体坛大腕。\n　　货真价实的政策\n　　当然仅有精神鼓励是不够的，美国政府知道它必须拿出货真价实的政策，否则有可能重复它在一战后犯下的错误。在第一次世界大战中，美国政府曾向参战美国军人承诺：他们每人每天除了可以得到1美元薪金之外，还有25美分作为海外生活补贴。这部分补贴将在战后逐步发放到位。但美国政府迟迟没有兑现承诺。上世纪30年代美国经济陷入萧条，老兵的日子更加难过。1932年春，4万名一战老兵及其家属和支持者聚集到华盛顿，要求政府立刻给钱。最后军方出动部队清场，导致几位老兵及其家属伤亡。这起事件后来被称为\u201c补贴行军\u201d，成为华盛顿脸上的一块疤。\n　　因此美国参加二战后不久，华盛顿就开始考虑战后退伍兵的补偿问题了，这也成为保障征兵的有力措施。1944年6月22日，美国国会通过了《军人安置法案》，通常被人称为《美国大兵权利法案》。这个法案对退伍兵的权益提供了全方位保护，可以说解决了年轻人入伍的后顾之忧。其中一个重要条款就是零首付购房，政府还提供低息贷款。另一个条款被称为\u201c52-20条款\u201d，即没有找到工作的退伍兵每周可以领到20美元的补助，一共发放52个星期。其实这笔拨款最终只用掉了不到20%，因为大多数老兵很快找到工作或者去念大学了。\n　　此外，政府每年还会向老兵发放500美元的教育补贴，帮助他们继续求学。结果到了1947年，美国大学新生中有49%是退伍兵。享受上述待遇的门槛并不高：只要二战期间在军中服役超过90天、不是被部队开除的老兵即可。事实证明，《军人安置法案》不仅有效地保障了美军兵源，还对战后经济复苏产生了重要影响。数以百万计的美国家庭搬出了市区的廉价公寓，搬到郊区的独栋房子里。退伍兵用教育补贴去念大学，为美国社会提供了大量高素质的劳动力。\n　　为吸引外国侨民加入美军，美国政府使出更厉害的一招\u2014\u2014\u201c解决户口\u201d，也就是获得美国公民权。通常外国人加入美国国籍会面临许多门槛，如年龄、种族、居住地、受教育程度、是否为敌国侨民等，此外还要交费，发表一个入籍动机声明。而在二战这个特殊时期，美国国会在1942年通过\u201c二战力量法案\u201d，免除非美国公民的美军士兵的上述入籍要求。1944年干脆连\u201c合法进入美国\u201d的证明也免了，也就是说即便你偷渡进来，也可以申请成为美国公民。\n　　为方便这些移民入籍，美国移民归化局的官员亲自到美军基地提供上门服务。他们还走出国门，为在海外服役的非美国公民士兵提供入籍服务。二战期间，移民归化局负责研究与教育服务的处长亨利·海扎德行程10万英里，足迹遍及六大洲，帮助6574名美军成为美国公民。这个数字接近二战期间所有入籍美军的一半。战争结束后美国战争部授予他一枚自由勋章。而二战时期征兵的一些譬如教育、入籍等的优惠政策，基本上延续到现在，没有太大的改动。\n关键词:\n二战\n兵力\n"}
     */

    private int code;
    private ForeignHistoryDetailBean foreign_History_Detail;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public ForeignHistoryDetailBean getForeign_History_Detail() {
        return foreign_History_Detail;
    }

    public void setForeign_History_Detail(ForeignHistoryDetailBean foreign_History_Detail) {
        this.foreign_History_Detail = foreign_History_Detail;
    }

    public static class ForeignHistoryDetailBean implements Serializable{
        /**
         * id : 6174
         * title : 美国为二战征兵力花样多：海报、政策动员2000万人应征
         * author : 彼岸花开
         * time : 2016-07-21
         * img_url : http://www.todayonhistory.com/uploadfile/2016/0721/20160721055938375.jpg
         * detail : 　　二战中，美国为了获得最后的胜利，采用了多种手段保证兵力充足，美国政府先后动员2000万人应征入伍，既有激奋人心的海报又有货真价实的政策。
         　　激奋人心的海报
         　　第二次世界大战中，美国政府先后动员2000万人应征入伍，为最终打败法西斯提供了充足的兵员保障。军史专家称，华盛顿综合运用多种征兵手段，既“唱高调”又给实惠，许多措施还惠及战后经济发展，可以说在战场以外又打了场胜仗。
         　　海报是各国政府在征兵时最常使用的宣传手段之一，美国也不例外。从第一次世界大战起，美国政府就为征兵海报设计了六大主题，其中爱国主义一直是“主旋律”。最有代表性的当属“山姆大叔需要你”海报。其实它在一战中就被广泛使用了，由于效果好，二战中美国政府继续使用它。画面中的山姆大叔以一个坚毅的父亲形象呈现，他用手指向你，配的广告语简单又直接——“我要你参加美国陆军”!曾有人这样评价这幅海报：“他直视你的灵魂，传递出荣誉与责任的信息。只要看上一眼，就足以让每一个热血男儿签约入伍”。它也被称为“有史以来最著名的宣传海报之一”。
         　　“珍珠港事件”后，美国出现一大批煽动对日仇恨的海报，其中比较著名的一张画面是这样的：一个日本兵手里拎着一把手枪，背上背着一个裸体白人女性，而配发的文字称，“这就是敌人”。
         　　在这些海报的鼓舞下，美国年轻人纷纷响应号召穿上军装，其中不乏明星大腕。影坛巨星詹姆斯·史都华在1941年底加入陆军航空队，成为第一位应征入伍的大牌影星。二战中他还成为空战英雄，最后升至空军准将。曾主演《乱世佳人》的大腕克拉克·盖博也加入陆军航空队，他大多数时间在英国战斗。初出茅庐的导演亨利·方达则加入了美国海军，成为一名情报军官。体坛明星也不甘落后。“珍珠港事件”发生后不久，美国职棒联盟克利夫兰印第安人队的投手鲍勃·费勒就报名参军，是第一个上战场的体坛大腕。
         　　货真价实的政策
         　　当然仅有精神鼓励是不够的，美国政府知道它必须拿出货真价实的政策，否则有可能重复它在一战后犯下的错误。在第一次世界大战中，美国政府曾向参战美国军人承诺：他们每人每天除了可以得到1美元薪金之外，还有25美分作为海外生活补贴。这部分补贴将在战后逐步发放到位。但美国政府迟迟没有兑现承诺。上世纪30年代美国经济陷入萧条，老兵的日子更加难过。1932年春，4万名一战老兵及其家属和支持者聚集到华盛顿，要求政府立刻给钱。最后军方出动部队清场，导致几位老兵及其家属伤亡。这起事件后来被称为“补贴行军”，成为华盛顿脸上的一块疤。
         　　因此美国参加二战后不久，华盛顿就开始考虑战后退伍兵的补偿问题了，这也成为保障征兵的有力措施。1944年6月22日，美国国会通过了《军人安置法案》，通常被人称为《美国大兵权利法案》。这个法案对退伍兵的权益提供了全方位保护，可以说解决了年轻人入伍的后顾之忧。其中一个重要条款就是零首付购房，政府还提供低息贷款。另一个条款被称为“52-20条款”，即没有找到工作的退伍兵每周可以领到20美元的补助，一共发放52个星期。其实这笔拨款最终只用掉了不到20%，因为大多数老兵很快找到工作或者去念大学了。
         　　此外，政府每年还会向老兵发放500美元的教育补贴，帮助他们继续求学。结果到了1947年，美国大学新生中有49%是退伍兵。享受上述待遇的门槛并不高：只要二战期间在军中服役超过90天、不是被部队开除的老兵即可。事实证明，《军人安置法案》不仅有效地保障了美军兵源，还对战后经济复苏产生了重要影响。数以百万计的美国家庭搬出了市区的廉价公寓，搬到郊区的独栋房子里。退伍兵用教育补贴去念大学，为美国社会提供了大量高素质的劳动力。
         　　为吸引外国侨民加入美军，美国政府使出更厉害的一招——“解决户口”，也就是获得美国公民权。通常外国人加入美国国籍会面临许多门槛，如年龄、种族、居住地、受教育程度、是否为敌国侨民等，此外还要交费，发表一个入籍动机声明。而在二战这个特殊时期，美国国会在1942年通过“二战力量法案”，免除非美国公民的美军士兵的上述入籍要求。1944年干脆连“合法进入美国”的证明也免了，也就是说即便你偷渡进来，也可以申请成为美国公民。
         　　为方便这些移民入籍，美国移民归化局的官员亲自到美军基地提供上门服务。他们还走出国门，为在海外服役的非美国公民士兵提供入籍服务。二战期间，移民归化局负责研究与教育服务的处长亨利·海扎德行程10万英里，足迹遍及六大洲，帮助6574名美军成为美国公民。这个数字接近二战期间所有入籍美军的一半。战争结束后美国战争部授予他一枚自由勋章。而二战时期征兵的一些譬如教育、入籍等的优惠政策，基本上延续到现在，没有太大的改动。
         关键词:
         二战
         兵力

         */

        private int id;
        private String title;
        private String author;
        private String time;
        private String img_url;
        private String detail;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getAuthor() {
            return author;
        }

        public void setAuthor(String author) {
            this.author = author;
        }

        public String getTime() {
            return time;
        }

        public void setTime(String time) {
            this.time = time;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }

        @Override
        public String toString() {
            return "ForeignHistoryDetailBean{" +
                    "id=" + id +
                    ", title='" + title + '\'' +
                    ", author='" + author + '\'' +
                    ", time='" + time + '\'' +
                    ", img_url='" + img_url + '\'' +
                    ", detail='" + detail + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "ForeignHistoryDetail{" +
                "code=" + code +
                ", foreign_History_Detail=" + foreign_History_Detail +
                '}';
    }
}
