package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/8.
 */

public class HistoryHeyDayInFo implements Serializable {

    /**
     * code : 200
     * china_History_Hey_Day_InFo : {"title":"七国之乱","img_url":"http://www.todayonhistory.com/uploadfile/2016/0518/20160518093702640.jpg","detail":"　　汉景帝发生了一场七国之乱，它是一次地方割据势力与中央专制皇权的对抗，最终七国之乱被平定，西汉诸侯王势力基本清除，中央集权得以巩固。\n　　七国之乱的发动者\n　　吴王刘濞联合楚王刘戊、赵王刘遂、济南王刘辟光、淄川王刘贤、胶西王刘昂、胶东王刘雄渠等刘姓宗室诸侯王，以\u201c清君侧\u201d为名发动叛乱。\n　　七国之乱事件经过\n　　诛杀晁错\n　　汉景帝三年（前154年）正月，吴王刘濞起兵广陵（今江苏扬州），置粮仓于淮南的东阳，向西渡过淮河，与楚兵会合，并派遣间谍和游军深入肴渑地区活动。吴楚联军渡过淮水，向西进攻，是叛乱的主力。胶西等国叛军共攻齐王刘将闾据守的临淄，赵国则约匈奴联兵犯汉。由于刘濞早有预谋，所以七国军队在叛乱之初进展顺利。\n　　汉景帝闻知消息，和晁错商量出兵事宜。晁错建议汉景帝御驾亲征，自己留守京城。曾当过吴国丞相的袁盎向景帝献策诛杀晁错，满足叛军\u201c清君侧\u201d的要求以换取他们退兵，景帝采纳了袁盎之计，封袁盎为太常，要他秘密整治行装，出使吴国。袁盎献策十多天后，丞相陶青、中尉陈嘉、廷尉张欧联名上书，弹劾晁错，提议将晁错满门抄斩。景帝批准了这道奏章，腰斩晁错于东市。\n　　但杀死晁错并没有让七国军队停下进攻的步伐，七国联军反而认为景帝软弱无能，于是刘濞自称东帝，与西汉政权分庭抗礼，拒见袁盎。汉景帝这才下决心武力镇压叛乱，派太尉周亚夫率三十六位将军领兵抵御吴楚联军，派曲周侯郦寄领兵攻打赵国、栾布攻击齐地诸叛国，并以大将军窦婴驻屯荥阳，监视齐、赵的动向。\n　　击败吴楚\n　　吴楚联军东进，行至梁国（治今河南商丘），遭到景帝之弟梁王刘武的顽强抵抗，吴楚联军并力攻城，攻下梁国南面的棘壁（今河南永城西北）。梁王刘武向朝廷告急，周亚夫认为吴楚联军势大，正面决战难以取胜，献策用梁王军队拖住吴、楚主力，寻找时机切断对方补给，然后伺机击溃叛军，景帝同意了周亚夫的计划。于是周亚夫绕道进军，走蓝田、出武关，迅速到达了雒阳。\n　　梁国被叛军轮番急攻，梁王向周亚夫求援。周亚夫却派军队向东，屯兵于梁国以北的昌邑（在今山东巨野西南），坚守不出。梁王再次派人求援，周亚夫还是不发救兵。最后梁王写信给汉景帝，景帝又下诏要周亚夫进兵增援，周亚夫还是不为所动，梁王于是任命韩安国与张羽为将军，拼死抵御，与吴楚联军僵持。\n　　梁国城池防守严密，吴兵无法西进，转而奔向周亚夫的军队。周亚夫坚守壁垒，不肯与战，私下却趁机轻兵南下，夺取泗水入淮之口（在今江苏洪泽境），断绝了叛军的粮道。吴军断粮，士兵饥饿，几次挑战未果，于是夜里袭击周亚夫军营，佯攻东南面，周亚夫命令于西北面守备。吴兵果然从西北强攻，未能攻破，吴兵大败，士兵多半饿死或投降走散，周亚夫率军追击，大破吴、楚联军。\n　　吴王与其麾下壮士数千人乘夜逃走，渡过淮河逃至丹徒（今江苏镇江），退守东越，并派人招集残兵。汉廷派人以利引诱东越，东越王骗吴王出去慰劳军队，用矛戟刺死吴王，献其头于汉朝。吴军溃散后，楚王刘戊自杀而死。\n　　平定叛乱\n　　在齐地，胶西王、胶东王、淄川王围攻齐都临淄，三月不下。汉将栾布率军进逼，三王便退兵回到封国。胶西王回国后，其子刘德建议袭击汉军，不成则逃到海上，胶西王不听。到汉营请罪，韩颓当斥责他阴谋叛乱，宣读诏书，胶西王自杀而死。胶东王、菑川王、济南王也都伏法被诛。\n　　在赵地，郦寄领兵进攻赵国，赵王刘遂坚守邯郸，郦寄久攻不下。匈奴得知吴楚兵败，也不肯出兵相助。栾布平定齐地诸国后，还军与郦寄会师，水淹邯郸城，邯郸城破，赵王刘遂自杀。\n　　济北王刘志被胁迫参与叛乱，后坚守不发兵，所以赦而未杀。\n　　齐王刘将闾为朝廷守城有功，但是他曾拟夺取帝位，后来还参预过七国之乱的策划，特别是在被围困时又与胶西王等通谋，因此不能见容于汉，被迫自杀。\n"}
     */

    private int code;
    private ChinaHistoryHeyDayInFoBean china_History_Hey_Day_InFo;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public ChinaHistoryHeyDayInFoBean getChina_History_Hey_Day_InFo() {
        return china_History_Hey_Day_InFo;
    }

    public void setChina_History_Hey_Day_InFo(ChinaHistoryHeyDayInFoBean china_History_Hey_Day_InFo) {
        this.china_History_Hey_Day_InFo = china_History_Hey_Day_InFo;
    }

    public static class ChinaHistoryHeyDayInFoBean implements Serializable {
        /**
         * title : 七国之乱
         * img_url : http://www.todayonhistory.com/uploadfile/2016/0518/20160518093702640.jpg
         * detail : 　　汉景帝发生了一场七国之乱，它是一次地方割据势力与中央专制皇权的对抗，最终七国之乱被平定，西汉诸侯王势力基本清除，中央集权得以巩固。
         * 　　七国之乱的发动者
         * 　　吴王刘濞联合楚王刘戊、赵王刘遂、济南王刘辟光、淄川王刘贤、胶西王刘昂、胶东王刘雄渠等刘姓宗室诸侯王，以“清君侧”为名发动叛乱。
         * 　　七国之乱事件经过
         * 　　诛杀晁错
         * 　　汉景帝三年（前154年）正月，吴王刘濞起兵广陵（今江苏扬州），置粮仓于淮南的东阳，向西渡过淮河，与楚兵会合，并派遣间谍和游军深入肴渑地区活动。吴楚联军渡过淮水，向西进攻，是叛乱的主力。胶西等国叛军共攻齐王刘将闾据守的临淄，赵国则约匈奴联兵犯汉。由于刘濞早有预谋，所以七国军队在叛乱之初进展顺利。
         * 　　汉景帝闻知消息，和晁错商量出兵事宜。晁错建议汉景帝御驾亲征，自己留守京城。曾当过吴国丞相的袁盎向景帝献策诛杀晁错，满足叛军“清君侧”的要求以换取他们退兵，景帝采纳了袁盎之计，封袁盎为太常，要他秘密整治行装，出使吴国。袁盎献策十多天后，丞相陶青、中尉陈嘉、廷尉张欧联名上书，弹劾晁错，提议将晁错满门抄斩。景帝批准了这道奏章，腰斩晁错于东市。
         * 　　但杀死晁错并没有让七国军队停下进攻的步伐，七国联军反而认为景帝软弱无能，于是刘濞自称东帝，与西汉政权分庭抗礼，拒见袁盎。汉景帝这才下决心武力镇压叛乱，派太尉周亚夫率三十六位将军领兵抵御吴楚联军，派曲周侯郦寄领兵攻打赵国、栾布攻击齐地诸叛国，并以大将军窦婴驻屯荥阳，监视齐、赵的动向。
         * 　　击败吴楚
         * 　　吴楚联军东进，行至梁国（治今河南商丘），遭到景帝之弟梁王刘武的顽强抵抗，吴楚联军并力攻城，攻下梁国南面的棘壁（今河南永城西北）。梁王刘武向朝廷告急，周亚夫认为吴楚联军势大，正面决战难以取胜，献策用梁王军队拖住吴、楚主力，寻找时机切断对方补给，然后伺机击溃叛军，景帝同意了周亚夫的计划。于是周亚夫绕道进军，走蓝田、出武关，迅速到达了雒阳。
         * 　　梁国被叛军轮番急攻，梁王向周亚夫求援。周亚夫却派军队向东，屯兵于梁国以北的昌邑（在今山东巨野西南），坚守不出。梁王再次派人求援，周亚夫还是不发救兵。最后梁王写信给汉景帝，景帝又下诏要周亚夫进兵增援，周亚夫还是不为所动，梁王于是任命韩安国与张羽为将军，拼死抵御，与吴楚联军僵持。
         * 　　梁国城池防守严密，吴兵无法西进，转而奔向周亚夫的军队。周亚夫坚守壁垒，不肯与战，私下却趁机轻兵南下，夺取泗水入淮之口（在今江苏洪泽境），断绝了叛军的粮道。吴军断粮，士兵饥饿，几次挑战未果，于是夜里袭击周亚夫军营，佯攻东南面，周亚夫命令于西北面守备。吴兵果然从西北强攻，未能攻破，吴兵大败，士兵多半饿死或投降走散，周亚夫率军追击，大破吴、楚联军。
         * 　　吴王与其麾下壮士数千人乘夜逃走，渡过淮河逃至丹徒（今江苏镇江），退守东越，并派人招集残兵。汉廷派人以利引诱东越，东越王骗吴王出去慰劳军队，用矛戟刺死吴王，献其头于汉朝。吴军溃散后，楚王刘戊自杀而死。
         * 　　平定叛乱
         * 　　在齐地，胶西王、胶东王、淄川王围攻齐都临淄，三月不下。汉将栾布率军进逼，三王便退兵回到封国。胶西王回国后，其子刘德建议袭击汉军，不成则逃到海上，胶西王不听。到汉营请罪，韩颓当斥责他阴谋叛乱，宣读诏书，胶西王自杀而死。胶东王、菑川王、济南王也都伏法被诛。
         * 　　在赵地，郦寄领兵进攻赵国，赵王刘遂坚守邯郸，郦寄久攻不下。匈奴得知吴楚兵败，也不肯出兵相助。栾布平定齐地诸国后，还军与郦寄会师，水淹邯郸城，邯郸城破，赵王刘遂自杀。
         * 　　济北王刘志被胁迫参与叛乱，后坚守不发兵，所以赦而未杀。
         * 　　齐王刘将闾为朝廷守城有功，但是他曾拟夺取帝位，后来还参预过七国之乱的策划，特别是在被围困时又与胶西王等通谋，因此不能见容于汉，被迫自杀。
         */

        private String title;
        private String img_url;
        private String detail;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }
    }
}
