package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/9.
 */

public class HistoryCheckDetail implements Serializable {


    /**
     * check_Detail : {"id":1,"title":"十大悲情奥运人物","img_url":"http://www.todayonhistory.com/uploadfile/2016/0808/20160808022012693.jpg","detail":"　　现代奥运会成立已经一百多年了，作为和平的象征、全人类的盛会，每一届奥运会都带给我们很多喜悦与忧伤。在奥运的赛场上，不止有凯旋的冠军，还有很多含恨而归的悲情英雄。他们在奥运会上失意的泪水也给我们带来了很多感动。小编就为大家盘点了奥运会上的十大悲情人物。\n　　10.姚明：带伤征战导致提前退役\n　　对于姚明这样级别的巨星来说，他的NBA生涯着实有些短暂，很多人认为这和他要兼顾国家队的比赛有关。在北京奥运会之前，姚明受了一次大伤，然而为了北京奥运会，他带伤上场，带领中国队进入八强。\n　　姚明的整个职业生涯，几乎从未得到足够的休息，每个夏天都要为国征战，赛季是别人的两倍。回首姚明在奥运赛场上的表现，不得不说总有一种独木难支的悲伤。\n　　9.费德勒：费天王无缘金满贯\n　　费德勒是世界网坛当之无愧的天王级选手。他曾17次夺得大满贯冠军。然而就是这样一位冠军选手却总是与奥运金牌失之交臂。\n　　就在里约奥运会临近开幕的时刻，费德勒却在自己的社交媒体上宣布因伤退出里约奥运会，这意味着现年35岁的费德勒已经基本与金满贯无缘（四大满贯+奥运会全部夺冠）。\n　　8.谭雪：一剑惜败痛失金牌\n　　在08年北京奥运会女子佩剑团体决赛中，中国队以一剑之差负于乌克兰队，获得亚军。上场比赛的谭雪泪流满面，剑道的对面，是乌克兰的全体队员和教练，她们欢呼雀跃高举国旗。同样是泪水，只是，一边是幸福，一边是心碎。\n　　在当天的直播中，谭雪的泪水感动了无数电视机前的观众。无数国人为这个\u201c中国女佐罗\u201d痛心不已。\n　　7.程菲：两度失误两度落泪\n　　在08年北京奥运会跳马和自由体操决赛的比赛中，程菲失误连连，跳马仅获铜牌，自由体操只得第七名。跳马比赛更是在自己赖以成名的\u201c程菲跳\u201d动作上出现重大失误。一贯冷静的程菲下场时难掩遗憾之情。失误时没有哭，却在全场观众的加油声中，程菲哭红了眼眶。\n　　现在随着年龄的增长，程菲也早已退役。可是昔日的体操一姐却从未获得单项比赛的奥运冠军。\n　　6.王皓：三连亚令人唏嘘\n　　说起乒乓球国手王皓的奥运之旅，恐怕很多人都会唏嘘不已。这样一名王者选手，三次参加奥运会男子单打项目，却连续三次倒在最后一步，最后获得令人哭笑不得的三连亚。\n　　一个从浮躁，低迷，到成熟，稳重的战士，他在面对坎坷的时候，总是以不屈的意志去战斗，去拼搏。一枚金牌比起这些来，已然微不足道。你可以不承认王皓的成功，但你不能否定王皓的伟大。\n　　5.李宗伟：既生瑜何生亮\n　　现实实在是太残酷了！李宗伟奥运会2008、2012年两次输给林丹屈居亚军，世锦赛2011、2013、2014、2015年连续四次与金牌擦肩而过，2010年亚运会、2014年汤杯也是银牌。\n　　他总是那么执着、那么勤奋、那么谦逊，但却总是功亏一篑，一直被林丹压在身下。两人可谓一时瑜亮，奈何时运不济，李宗伟总是得不到命运的青睐。\n　　4.刘翔：两次因伤退赛\n　　2004雅典奥运会，年仅21岁的刘翔在男子110米栏决赛的跑道上，石破天惊地第一个跑过终点。08年北京奥运会，在鸟巢体育场近十万国人的注目下，刘翔因伤退出比赛。在12年伦敦，这一幕再次上演，刘翔在攻第一个栏时直接打栏摔倒在地，最终单腿跳过终点，亲吻栏架作为谢幕。\n　　无论外界如何评论，刘翔始终都是我心中的英雄。只是这样的英雄两次因伤病退出奥运会的赛场，不得不令人唏嘘感叹。\n　　3.巴西男足：足球王国无缘奥运冠军\n　　巴西作为足球王国，赢得过五次世界杯冠军，巴西足坛可谓人才辈出。无数响彻世界足坛的名字都是出自这片土地。然而就是这样一个足球王国却从未获得过奥运会的足球金牌。此次在巴西本土举行奥运会，希望巴西人能获得突破。\n　　2.奥蒂：七次参赛却是无冕之王\n　　牙买加短跑女皇奥蒂，从1980年莫斯科奥运会到2000年悉尼奥运会，共参加了七届奥运会、作为参加奥运会次数最多的田径选手，奥蒂总共赢得了3银6铜共9枚奖牌，但独缺一金。\n　　1996年亚特兰大奥运会，已经36岁的奥蒂在100米决赛中，与德弗斯并肩冲过终点，借助高速摄影照片判定，奥蒂以千分之五秒的极微弱劣势屈居亚军，这也被认为是奥运历史上最让人心碎的失利之一。\n　　1.埃蒙斯：连续三次打丢最后一枪\n　　埃蒙斯大概算得上是最倒霉的奥运选手了。04年雅典奥运会，男子步枪三姿决赛，埃蒙斯最后一枪竟然将子弹打到了别人靶子上，而且还是10.6环。四年后在北京，埃蒙斯噩梦继续，男子50米步枪三姿决赛，埃蒙斯在倒数第二轮领先将近4环的情况下，再次倒在了最后一枪上。事不过三，但在伦敦奥运会决赛场地上时，惊人的一幕再次发生了。男子50米步枪三姿决赛，埃蒙斯在决赛第9枪还领先对手1环多的情况下，最后一枪打出了7.6环又一次丢掉冠军。\n　　2010年9月，埃蒙斯还被确诊甲状腺癌。可是厄运也不会一直伴随着他，后来他手术顺利，成功康复。现在还活跃在国际射击赛场上。埃蒙斯即将再次亮相里约，希望这次他能打破魔咒。\n"}
     * code : 200
     */

    private CheckDetailBean check_Detail;
    private int code;

    public CheckDetailBean getCheck_Detail() {
        return check_Detail;
    }

    public void setCheck_Detail(CheckDetailBean check_Detail) {
        this.check_Detail = check_Detail;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public static class CheckDetailBean implements Serializable{
        /**
         * id : 1
         * title : 十大悲情奥运人物
         * img_url : http://www.todayonhistory.com/uploadfile/2016/0808/20160808022012693.jpg
         * detail : 　　现代奥运会成立已经一百多年了，作为和平的象征、全人类的盛会，每一届奥运会都带给我们很多喜悦与忧伤。在奥运的赛场上，不止有凯旋的冠军，还有很多含恨而归的悲情英雄。他们在奥运会上失意的泪水也给我们带来了很多感动。小编就为大家盘点了奥运会上的十大悲情人物。
         　　10.姚明：带伤征战导致提前退役
         　　对于姚明这样级别的巨星来说，他的NBA生涯着实有些短暂，很多人认为这和他要兼顾国家队的比赛有关。在北京奥运会之前，姚明受了一次大伤，然而为了北京奥运会，他带伤上场，带领中国队进入八强。
         　　姚明的整个职业生涯，几乎从未得到足够的休息，每个夏天都要为国征战，赛季是别人的两倍。回首姚明在奥运赛场上的表现，不得不说总有一种独木难支的悲伤。
         　　9.费德勒：费天王无缘金满贯
         　　费德勒是世界网坛当之无愧的天王级选手。他曾17次夺得大满贯冠军。然而就是这样一位冠军选手却总是与奥运金牌失之交臂。
         　　就在里约奥运会临近开幕的时刻，费德勒却在自己的社交媒体上宣布因伤退出里约奥运会，这意味着现年35岁的费德勒已经基本与金满贯无缘（四大满贯+奥运会全部夺冠）。
         　　8.谭雪：一剑惜败痛失金牌
         　　在08年北京奥运会女子佩剑团体决赛中，中国队以一剑之差负于乌克兰队，获得亚军。上场比赛的谭雪泪流满面，剑道的对面，是乌克兰的全体队员和教练，她们欢呼雀跃高举国旗。同样是泪水，只是，一边是幸福，一边是心碎。
         　　在当天的直播中，谭雪的泪水感动了无数电视机前的观众。无数国人为这个“中国女佐罗”痛心不已。
         　　7.程菲：两度失误两度落泪
         　　在08年北京奥运会跳马和自由体操决赛的比赛中，程菲失误连连，跳马仅获铜牌，自由体操只得第七名。跳马比赛更是在自己赖以成名的“程菲跳”动作上出现重大失误。一贯冷静的程菲下场时难掩遗憾之情。失误时没有哭，却在全场观众的加油声中，程菲哭红了眼眶。
         　　现在随着年龄的增长，程菲也早已退役。可是昔日的体操一姐却从未获得单项比赛的奥运冠军。
         　　6.王皓：三连亚令人唏嘘
         　　说起乒乓球国手王皓的奥运之旅，恐怕很多人都会唏嘘不已。这样一名王者选手，三次参加奥运会男子单打项目，却连续三次倒在最后一步，最后获得令人哭笑不得的三连亚。
         　　一个从浮躁，低迷，到成熟，稳重的战士，他在面对坎坷的时候，总是以不屈的意志去战斗，去拼搏。一枚金牌比起这些来，已然微不足道。你可以不承认王皓的成功，但你不能否定王皓的伟大。
         　　5.李宗伟：既生瑜何生亮
         　　现实实在是太残酷了！李宗伟奥运会2008、2012年两次输给林丹屈居亚军，世锦赛2011、2013、2014、2015年连续四次与金牌擦肩而过，2010年亚运会、2014年汤杯也是银牌。
         　　他总是那么执着、那么勤奋、那么谦逊，但却总是功亏一篑，一直被林丹压在身下。两人可谓一时瑜亮，奈何时运不济，李宗伟总是得不到命运的青睐。
         　　4.刘翔：两次因伤退赛
         　　2004雅典奥运会，年仅21岁的刘翔在男子110米栏决赛的跑道上，石破天惊地第一个跑过终点。08年北京奥运会，在鸟巢体育场近十万国人的注目下，刘翔因伤退出比赛。在12年伦敦，这一幕再次上演，刘翔在攻第一个栏时直接打栏摔倒在地，最终单腿跳过终点，亲吻栏架作为谢幕。
         　　无论外界如何评论，刘翔始终都是我心中的英雄。只是这样的英雄两次因伤病退出奥运会的赛场，不得不令人唏嘘感叹。
         　　3.巴西男足：足球王国无缘奥运冠军
         　　巴西作为足球王国，赢得过五次世界杯冠军，巴西足坛可谓人才辈出。无数响彻世界足坛的名字都是出自这片土地。然而就是这样一个足球王国却从未获得过奥运会的足球金牌。此次在巴西本土举行奥运会，希望巴西人能获得突破。
         　　2.奥蒂：七次参赛却是无冕之王
         　　牙买加短跑女皇奥蒂，从1980年莫斯科奥运会到2000年悉尼奥运会，共参加了七届奥运会、作为参加奥运会次数最多的田径选手，奥蒂总共赢得了3银6铜共9枚奖牌，但独缺一金。
         　　1996年亚特兰大奥运会，已经36岁的奥蒂在100米决赛中，与德弗斯并肩冲过终点，借助高速摄影照片判定，奥蒂以千分之五秒的极微弱劣势屈居亚军，这也被认为是奥运历史上最让人心碎的失利之一。
         　　1.埃蒙斯：连续三次打丢最后一枪
         　　埃蒙斯大概算得上是最倒霉的奥运选手了。04年雅典奥运会，男子步枪三姿决赛，埃蒙斯最后一枪竟然将子弹打到了别人靶子上，而且还是10.6环。四年后在北京，埃蒙斯噩梦继续，男子50米步枪三姿决赛，埃蒙斯在倒数第二轮领先将近4环的情况下，再次倒在了最后一枪上。事不过三，但在伦敦奥运会决赛场地上时，惊人的一幕再次发生了。男子50米步枪三姿决赛，埃蒙斯在决赛第9枪还领先对手1环多的情况下，最后一枪打出了7.6环又一次丢掉冠军。
         　　2010年9月，埃蒙斯还被确诊甲状腺癌。可是厄运也不会一直伴随着他，后来他手术顺利，成功康复。现在还活跃在国际射击赛场上。埃蒙斯即将再次亮相里约，希望这次他能打破魔咒。

         */

        private int id;
        private String title;
        private String img_url;
        private String detail;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }

        @Override
        public String toString() {
            return "CheckDetailBean{" +
                    "id=" + id +
                    ", title='" + title + '\'' +
                    ", img_url='" + img_url + '\'' +
                    ", detail='" + detail + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "HistoryCheckDetail{" +
                "check_Detail=" + check_Detail +
                ", code=" + code +
                '}';
    }
}
