package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/8.
 */

public class HistoryHeyDayInFo implements Serializable {


    /**
     * code : 200
     * china_History_Hey_Day_InFo : {"id":1,"title":"七一五反革命政变","img_url":"http://www.todayonhistory.com/uploadfile/2016/1118/20161118103649397.jpg","detail":"七一五反革命政变\n　　1927年7月15日，七一五反革命政变爆发，武汉国民政府领导人汪精卫宣布停止与中国共产党合作，使第一次国共合作正式结束，原先采取的\u201c联俄容共\u201d方针逐渐演变为\u201c反共清共\u201d，之后大肆屠杀共产党人。\n　　七一五反革命政变真相\n　　1927年7月14日晚，武汉国民党中央政治委员会主席团召开秘密会议，接受了汪精卫提出的\u201c分共\u201d主张，决定将《统一本党政策案》和《统一本党政策决议案》提交国民党中央执行委员会常务委员会扩大会议通过实行。1927年7月15日，国民党中央执行委员会举行第二届常务委员会第20次扩大会议。出席会议的有汪精卫、孙科、谭延闿、顾孟余、陈公博等17人。汪精卫在会上宣读了共产国际5月指示，并就其内容发表了长篇讲话。他认为，共产国际提出开展土地革命，由下级没收地主的土地，违背了国民党关于由国民政府下令没收土地的主张，与\u201c三民主义相冲突\u201d。并攻击说湖南是按照共产国际的训令去做的，\u201c怪不得湖南闹成这个样子\u201d。他指责共产国际提出要在国民党的中央委员中\u201c多增加工农领袖\u201d，\u201c简直是破坏本党的组织\u201d。他攻击共产国际关于武装工农、改造旧军队的指示，\u201c是根本动摇我们的军队\u201d。他歪曲组织以有声望的国民党人为首的革命军事法庭的目的，说什么组织特别法庭，不要共产党同志参加，由老党员组织，就是\u201c让国民党做刽子手\u201d。汪精卫声称，\u201c综合这五条而论，随便实行哪一条国民党就完了！\u201d这是共产党\u201c破坏国民党的阴谋\u201d。汪精卫提请会议讨论决定两个问题：一是派负责任的重要同志到苏联的莫斯科去，重申国民党的联俄政策\u201c乃是三民主义联合共产主义，三民主义的中国联合共产主义的俄国\u201d，\u201c若是丢开了三民主义那就不是联俄而是降俄了\u201d。二是对共产党应采取一个\u201c处置办法\u201d，因为\u201c一党之内不能主义与主义冲突，政策与政策冲突，更不能有两个最高机关\u201d。孙科、顾孟余、谭延闿等发言，认为\u201c共产党同志加入国民党是要使三民主义共产主义化\u201d，\u201c将国民党作为共产党的工具\u201d，国民党的主义、政策、组织\u201c差不多都受了容共的影响\u201d，因此，不能不对共产党\u201c加以相当的制裁\u201d。\n　　会议根据汪精卫的提议通过了3项决定：一、在一个月内，召开第四次中央执行委员会全体会议，讨论政治委员会主席团所提出的意见并解决之；二、第四次中央执行委员会全体会议开会之前，中央党部应裁制一切违反本党主义政策的言论行动；三、派遣重要同志前赴苏俄，讨论切实联合办法，其人选由政治委员会决定。汪精卫等控制的武汉国民党中央决定与共产党决裂，彻底背叛了孙中山制定的国共合作政策和反帝反封建的革命纲领。\n　　七一五反革命政变意义\n　　1927年7月16日，汪精卫向国民党中央政治委员会主席团报告《容共政策之最近经过》，声称中共中央1927年7月13日发表的《对政局宣言》是对国民党的\u201c厚诬丑低\u201d，中共中央决定撤回参加国民政府的共产党员\u201c是共产党破坏容共政策之最大表示\u201d。他说，既然共产党退出国民政府，\u201c便无异脱离本党\u201d。它在国民革命军及各级政府机关中亦无须存在。这是汪精卫发出的\u201c取缔共产党\u201d的动员令。同日，武汉国民党中央执行委员会向各级党部发出《保护共产党员个人身体自由的训令》和《保护农工之训令》，虚伪地声称：1927年7月15日限制共产分子的提案是执行党的纪律，并非妨害共产党员个人身体自由，若压迫共产党而妨害其身体自由，定要依法严办。国民党中央并不因限制共产主义而停止农工政策之活动，对于农工团体须极力保护，对于农工利益须加意维持；若违背党义，少加摧残，唯有执行革命纪律。与此同时，汪精卫集团在武汉的党、政、军部门进行大规模\u201c清党\u201d。\n　　1927年7月19日，武汉国民政府训令通饬各军长官务须于最短期间，对所属军队中的军事负责人员和政治工作人员进行核查，对已经知名的共产党员应切实劝导，使之\u201c与共产党脱离关系\u201d，否则即行停止职务；对未知名的共产党员则应随时留心查禁，禁止一切秘密会议，并考核其言论行动，如有违反本党主义及政策者，立予惩办。\n　　1927年7月24日，中共中央发表《对于武汉反动时局之通告》和《致中国国民党革命同志书》，强烈抗议武汉国民党中央作出的\u201c分共\u201d决定，号召革命的国民党员应与叛变革命的汪精卫集团决裂，实行孙中山的三民主义的革命政纲和三大政策，明确表示中国共产党党员决心和革命的国民党员共同工作，同生共死，继续孙中山的国民革命事业。之后，汪精卫集团连续发布公开取缔共产党的反动法令。1927年7月26日，武汉国民党中央执行委员会公布1927年7月14日中央政治委员会主席团提出的《统一本党政策案》，宣布：一、凡列名国民党员，在各级党部、各级政府和国民革命军中任职者，应自即日起脱离共产党，否则一律停止职务。二、共产党员不得以国民党名义做共产党的工作。三、国民党党员未经中央许可，不得加入他党，违反者以叛党论。\n　　1927年7月27日，武汉国民党中央执行委员会发表《告中国共产党书》，诬蔑加入国民党的共产党员\u201c不愿接受本党决议，而至破坏全部革命工作\u201d，指责湖南的共产党组织对于土地问题自布一种经济没收办法，是不愿与国民党合作，自绝于国民党的表现，并宣称：共产党应即自憬放弃其\u201c对本党敌视的态度\u201d，否则就要执行相当的纪律。同日，国民党中央训令各省党部、各省政府、各军部，应对共产党人的活动\u201c严加防范\u201d。\n　　1927年8月1日，武汉国民政府发布命令，要国民政府领域之内的共产党员\u201c务须洗心革面\u201d，否则，一经拿获，即行明正典刑，\u201c决不宽恕\u201d。汪精卫集团在武汉地区搜捕、屠杀共产党人、革命人士和工农群众。随着汪精卫集团的叛变革命，国共两党的合作彻底破裂，1924年至1927年的大革命宣告失败。\n　　南昌起义及镇压\n　　武汉国民政府于7月15日的进行分共事件，令其与中共的矛盾升温。7月19日，中共及共青团对国民党及汪精卫续行攻击。26日，国民党采取严厉措施，免去各机关中的中共党员职务。决定组建自己武装的中共于8月1日在南昌发动起事，而中共方面则一直称大革命的失败才导致了军队建立。武汉方面决定予以镇压，被舆论评价\u201c较南京政府之清党似犹过之\u201d。中国大陆的历史教科书等用\u201c宁可错杀一千，不可使一人漏网\u201d形容当时的血腥景象，但没有明确提及这句话是在什么时候说的，且认为是汪精卫本人的发言。据谢觉哉回忆，湖北曾有\u201c宁肯错杀三千，不肯放松一个\u201d的布告。而当时国民革命军第19军副军长陶钧最以此发言闻名。汪精卫本人至少在南昌起义前，一直否认主张对共产党开杀戒。\n　　宁汉合流\n　　汉方在分共的同时，并未放弃讨蒋。而蒋中正主持北伐不利，徐州失守。李宗仁为首的桂系又软硬兼施，终于逼迫蒋中正与胡汉民、张人杰等人决定下野。李宗仁领衔发电庆祝汉方分共，当时蒋中正仅列名第四位。8月13日蒋中正正式下野，8月底9月初武汉国民政府机关陆续迁往南京。\n"}
     */

    private int code;
    private ChinaHistoryHeyDayInFoBean china_History_Hey_Day_InFo;

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public ChinaHistoryHeyDayInFoBean getChina_History_Hey_Day_InFo() {
        return china_History_Hey_Day_InFo;
    }

    public void setChina_History_Hey_Day_InFo(ChinaHistoryHeyDayInFoBean china_History_Hey_Day_InFo) {
        this.china_History_Hey_Day_InFo = china_History_Hey_Day_InFo;
    }

    public static class ChinaHistoryHeyDayInFoBean implements Serializable {
        /**
         * id : 1
         * title : 七一五反革命政变
         * img_url : http://www.todayonhistory.com/uploadfile/2016/1118/20161118103649397.jpg
         * detail : 七一五反革命政变
         　　1927年7月15日，七一五反革命政变爆发，武汉国民政府领导人汪精卫宣布停止与中国共产党合作，使第一次国共合作正式结束，原先采取的“联俄容共”方针逐渐演变为“反共清共”，之后大肆屠杀共产党人。
         　　七一五反革命政变真相
         　　1927年7月14日晚，武汉国民党中央政治委员会主席团召开秘密会议，接受了汪精卫提出的“分共”主张，决定将《统一本党政策案》和《统一本党政策决议案》提交国民党中央执行委员会常务委员会扩大会议通过实行。1927年7月15日，国民党中央执行委员会举行第二届常务委员会第20次扩大会议。出席会议的有汪精卫、孙科、谭延闿、顾孟余、陈公博等17人。汪精卫在会上宣读了共产国际5月指示，并就其内容发表了长篇讲话。他认为，共产国际提出开展土地革命，由下级没收地主的土地，违背了国民党关于由国民政府下令没收土地的主张，与“三民主义相冲突”。并攻击说湖南是按照共产国际的训令去做的，“怪不得湖南闹成这个样子”。他指责共产国际提出要在国民党的中央委员中“多增加工农领袖”，“简直是破坏本党的组织”。他攻击共产国际关于武装工农、改造旧军队的指示，“是根本动摇我们的军队”。他歪曲组织以有声望的国民党人为首的革命军事法庭的目的，说什么组织特别法庭，不要共产党同志参加，由老党员组织，就是“让国民党做刽子手”。汪精卫声称，“综合这五条而论，随便实行哪一条国民党就完了！”这是共产党“破坏国民党的阴谋”。汪精卫提请会议讨论决定两个问题：一是派负责任的重要同志到苏联的莫斯科去，重申国民党的联俄政策“乃是三民主义联合共产主义，三民主义的中国联合共产主义的俄国”，“若是丢开了三民主义那就不是联俄而是降俄了”。二是对共产党应采取一个“处置办法”，因为“一党之内不能主义与主义冲突，政策与政策冲突，更不能有两个最高机关”。孙科、顾孟余、谭延闿等发言，认为“共产党同志加入国民党是要使三民主义共产主义化”，“将国民党作为共产党的工具”，国民党的主义、政策、组织“差不多都受了容共的影响”，因此，不能不对共产党“加以相当的制裁”。
         　　会议根据汪精卫的提议通过了3项决定：一、在一个月内，召开第四次中央执行委员会全体会议，讨论政治委员会主席团所提出的意见并解决之；二、第四次中央执行委员会全体会议开会之前，中央党部应裁制一切违反本党主义政策的言论行动；三、派遣重要同志前赴苏俄，讨论切实联合办法，其人选由政治委员会决定。汪精卫等控制的武汉国民党中央决定与共产党决裂，彻底背叛了孙中山制定的国共合作政策和反帝反封建的革命纲领。
         　　七一五反革命政变意义
         　　1927年7月16日，汪精卫向国民党中央政治委员会主席团报告《容共政策之最近经过》，声称中共中央1927年7月13日发表的《对政局宣言》是对国民党的“厚诬丑低”，中共中央决定撤回参加国民政府的共产党员“是共产党破坏容共政策之最大表示”。他说，既然共产党退出国民政府，“便无异脱离本党”。它在国民革命军及各级政府机关中亦无须存在。这是汪精卫发出的“取缔共产党”的动员令。同日，武汉国民党中央执行委员会向各级党部发出《保护共产党员个人身体自由的训令》和《保护农工之训令》，虚伪地声称：1927年7月15日限制共产分子的提案是执行党的纪律，并非妨害共产党员个人身体自由，若压迫共产党而妨害其身体自由，定要依法严办。国民党中央并不因限制共产主义而停止农工政策之活动，对于农工团体须极力保护，对于农工利益须加意维持；若违背党义，少加摧残，唯有执行革命纪律。与此同时，汪精卫集团在武汉的党、政、军部门进行大规模“清党”。
         　　1927年7月19日，武汉国民政府训令通饬各军长官务须于最短期间，对所属军队中的军事负责人员和政治工作人员进行核查，对已经知名的共产党员应切实劝导，使之“与共产党脱离关系”，否则即行停止职务；对未知名的共产党员则应随时留心查禁，禁止一切秘密会议，并考核其言论行动，如有违反本党主义及政策者，立予惩办。
         　　1927年7月24日，中共中央发表《对于武汉反动时局之通告》和《致中国国民党革命同志书》，强烈抗议武汉国民党中央作出的“分共”决定，号召革命的国民党员应与叛变革命的汪精卫集团决裂，实行孙中山的三民主义的革命政纲和三大政策，明确表示中国共产党党员决心和革命的国民党员共同工作，同生共死，继续孙中山的国民革命事业。之后，汪精卫集团连续发布公开取缔共产党的反动法令。1927年7月26日，武汉国民党中央执行委员会公布1927年7月14日中央政治委员会主席团提出的《统一本党政策案》，宣布：一、凡列名国民党员，在各级党部、各级政府和国民革命军中任职者，应自即日起脱离共产党，否则一律停止职务。二、共产党员不得以国民党名义做共产党的工作。三、国民党党员未经中央许可，不得加入他党，违反者以叛党论。
         　　1927年7月27日，武汉国民党中央执行委员会发表《告中国共产党书》，诬蔑加入国民党的共产党员“不愿接受本党决议，而至破坏全部革命工作”，指责湖南的共产党组织对于土地问题自布一种经济没收办法，是不愿与国民党合作，自绝于国民党的表现，并宣称：共产党应即自憬放弃其“对本党敌视的态度”，否则就要执行相当的纪律。同日，国民党中央训令各省党部、各省政府、各军部，应对共产党人的活动“严加防范”。
         　　1927年8月1日，武汉国民政府发布命令，要国民政府领域之内的共产党员“务须洗心革面”，否则，一经拿获，即行明正典刑，“决不宽恕”。汪精卫集团在武汉地区搜捕、屠杀共产党人、革命人士和工农群众。随着汪精卫集团的叛变革命，国共两党的合作彻底破裂，1924年至1927年的大革命宣告失败。
         　　南昌起义及镇压
         　　武汉国民政府于7月15日的进行分共事件，令其与中共的矛盾升温。7月19日，中共及共青团对国民党及汪精卫续行攻击。26日，国民党采取严厉措施，免去各机关中的中共党员职务。决定组建自己武装的中共于8月1日在南昌发动起事，而中共方面则一直称大革命的失败才导致了军队建立。武汉方面决定予以镇压，被舆论评价“较南京政府之清党似犹过之”。中国大陆的历史教科书等用“宁可错杀一千，不可使一人漏网”形容当时的血腥景象，但没有明确提及这句话是在什么时候说的，且认为是汪精卫本人的发言。据谢觉哉回忆，湖北曾有“宁肯错杀三千，不肯放松一个”的布告。而当时国民革命军第19军副军长陶钧最以此发言闻名。汪精卫本人至少在南昌起义前，一直否认主张对共产党开杀戒。
         　　宁汉合流
         　　汉方在分共的同时，并未放弃讨蒋。而蒋中正主持北伐不利，徐州失守。李宗仁为首的桂系又软硬兼施，终于逼迫蒋中正与胡汉民、张人杰等人决定下野。李宗仁领衔发电庆祝汉方分共，当时蒋中正仅列名第四位。8月13日蒋中正正式下野，8月底9月初武汉国民政府机关陆续迁往南京。

         */

        private int id;
        private String title;
        private String img_url;
        private String detail;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }

        @Override
        public String toString() {
            return "ChinaHistoryHeyDayInFoBean{" +
                    "id=" + id +
                    ", title='" + title + '\'' +
                    ", img_url='" + img_url + '\'' +
                    ", detail='" + detail + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "HistoryHeyDayInFo{" +
                "code=" + code +
                ", china_History_Hey_Day_InFo=" + china_History_Hey_Day_InFo +
                '}';
    }
}
