package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/9.
 */

public class HistoryCheckDetail implements Serializable {

    /**
     * check_Detail : {"title":"志愿军八大血战","img_url":"http://www.todayonhistory.com/uploadfile/2016/0421/20160421045025833.jpg","detail":"　　抗美援朝战争为朝鲜战争之一部分，仅指中国人民志愿军参战的阶段。朝鲜战争原是朝鲜半岛上的朝韩之间的民族内战，后分别支持朝韩双方的美国、苏联、中国等多个国家不同程度地卷入这场战争。在经历了长期矛盾和冲突积累后，1950年6月25日朝鲜得到苏联默许进行统一战争，历时三年的朝鲜战争爆发。8月中旬，北朝鲜人民军将韩国军驱至釜山一隅，攻占了韩国90%的领土。9月15日，以美军为主的联合国军(美国、英国、加拿大、澳大利亚、新西兰、荷兰、法国、土耳其、泰国、菲律宾、希腊、比利时、哥伦比亚、埃塞俄比亚、南非、卢森堡)在仁川登陆，直接介入朝鲜战争，并将战火扩大至中国鸭绿江边。\n　　(1)血战飞虎山\n　　第二次战役根据彭德怀\u201c诱敌深入\u201d的计划，为了不让联合国军北进的速度太快而影响中国军队的调动和威胁中国军队的侧后，彭德怀命令112师335团依据飞虎山之险阻击联合国军。11月4日335团经过血战占领飞虎山，到11月8日部队完成阻击任务安全撤离，经过五昼夜的血战，防守部队承受着韩国第七师和美军一部的立体攻击，最激烈的8日毫无防空力量的志愿军承受80余架美机及大炮地毯式轰炸，所有阵地均进入了肉搏战，守卫飞虎山主阵地的335团2营阵亡者十之六七，其中五连三排仅余3名战斗人员。本次血战共毙伤俘敌1800余人，飞虎山前共有美韩军遗失400多具，335团及团长范天恩由此威名天下。\n　　(2)血战长津湖\n　　血战长津湖是在第二次战役以美军为首的联合国军猖狂北犯，11月底进到长津湖一带，志愿军第九兵团冒着零下30多度的严寒设置伏击圈，11月27日九兵团发起全线攻击，当时被包围的美国陆战一师约有四个团一万多人，超出预定一倍以下。到28日拂晓志愿军包围新兴里之敌，美国则凶猛地反扑，其中80师伤亡及冻饿减员十分严重，每团仅余数百人!故81师加入新兴里战斗，随着包围圈越来越小，美军突围一次比一次疯狂。当晚气温继续下降，美国全力向241团阵地发起冲击，其中241团3营8连战斗到仅剩最后一人，美军侥幸得以突围，志愿军只好分路截击，南逃美军在1221高地受至阻击分散而逃，至12月2日只有200多美军逃入柳潭里，至此美军31团，32团1营及第57炮兵营被27军基本被歼灭。二次战役中西线的长津之战以美陆1师的成建制撤退而告终，未能达到志司全歼美1师的设想。据美军战后统计，美陆1师战斗减员4418人，其中604人在战斗中阵亡，114人死于战伤，192人在战斗中失踪，3508人在作战中负伤，冻伤减员7313人，减员数达到了全师兵力的40%。加上美陆7师和其他部队的损失，美军战斗死伤达万余人。反观九兵团的损失，据官方公布的数字。九兵团战斗减员19202人，冻伤28954人，减员48156人，整个长津作战损失兵力达兵团总人数的三分之一。\n　　下碣里是美军全军的退路，志愿军58师奉命攻占此地，经过战斗至30日深夜全师不足12个连，只剩下1500人，仅有少量迫击炮支援的志愿军冒着美军密集的火力一波又一波，前赴后继，一度突入敌人防守的阵地，然而在突击过程中伤亡太大导致后援不继，在美军反击下突入阵地的战士全部牺牲!志愿军在战斗中所表现出的视死如归般的勇敢，令美军肃然起敬!美军在下碣里的防御得到加强后，德洞山口又成了双方争夺的焦点。12月3日柳潭里的陆战5团和7团主力陆续到达德洞山口，遂坦克开路飞机掩护，开始全线撤退。此后美军在退路上不断受到志愿军的攻击，但美军的优势装备得到很好的发挥，没有受阻，至陆战一师逃到真兴里后意味着他们逃离的包围圈，但九兵团不甘就此放过陆战一师，不顾一切代价，组织力量追歼，无奈11日陆战1师登船安全撤离。这是一场真正的鏖战，志愿军投入3个军12个师总兵力为15万人，冻伤达30000多人，冻死达4000多人，阵亡1.5万人，美军伤亡为7000人，其中阵亡及失踪为2500多人，冻伤减员为7300人。\n　　(3)血战三所里\n　　第二次战役美军受到志愿军的迎头痛击后，迅速南撤，三所里及龙源里是美军主力的唯一退路，38军113师强行军14小时疾进72.5公里穿插到三所里，同时师长江潮命337团抢占龙源里，这样切断美第九军的退路。美军为打通退路，动用飞机坦克疯狂空围，坚守松骨峰的335团一营三连最后仅五人生还。美军在三所里连续冲锋十数次均为打退，美军第9军见从三所里、龙源里突围无望,被迫遗弃大量辎重装备转向安州方向突围，后经安州、肃川退向平壤。但此战打出了38军王牌军的硬骨头风采，战后彭德怀特嘉奖38军，\u201c万岁军\u201d由此名扬天下。\n　　(4)血战横城\n　　第四次战役为遏制联合国军的猛烈攻势，彭总命在横城一带打击敌人，于是横城反击战于1951年2月11日晚展开，志愿集结四个军和人民军两个军团欲全歼韩国第五师和第八师。志愿军39军117师350团长途奔袭插到敌后方，12日美退下来的美2师一部和韩国第八师2个营进入伏击圈，战斗异常激烈，相当一部分志愿军弹药全部打光拚上了刺刀，前往支援美2师一个营进入了别一个伏击圈，至2月13日横城之战结束，韩国第八师3个团，韩第三师和第五师各一部，美2师一个营，美韩4个炮兵营被消灭，共计12000多人。此战狠狠教训了李奇微，事隔10多年以后，李奇微在回忆横城地区的作战时仍心有余悸。\n　　(5)血战砥平里\n　　第四次战役为保持全线不致崩溃，李奇微命第十军死守砥平里，防守砥平里的是美二师第二十三团(包括法国营在内有四个步兵营，以及一个炮兵营和一个坦克中队，总计6000人)，第三十八团为预备队，第九军，英第二十九旅，韩国第六师向砥平里和文幕里之间移动。志愿军攻击部队投入了来自三十九，四十，第十二军的三个军八个团，由40军199师统一指挥，2月13日晚砥平里开始受到志愿军的攻击.\n　　此后几天里，中国军队一往无前的一波接一波的攻击，无所畏惧，参加太平洋战争的美军望着踏着同伴尸体冲锋的中共部队非常恐惧，他们见到了比日军更不惜生命的部队，美国动用的大量航空兵，炮兵持续不断反反复复地轰炸志愿军的攻击方向，每平方米落下几十颗炸弹，鲜血染红的砥平里，一百多人的连队往往几分钟后仅剩七八人，战斗到最后的战士往往与反击的敌人同归于尽皆是，志愿军阵亡者应在5000人以上，仅40军三个团伤亡就达1830人，359团3营仅有数人生还，由于通讯不畅，敌我装备相差悬殊，没有炮兵航空兵只有简陋装备的志愿军装备最终无法突破美军的防线撤出战斗，但志愿军的英勇令敌手感到他们遇到了有世界第一勇气的部队。\n　　(6)血战铁原\n　　第五次第二阶段，以美军第一军为首的数万敌军突然直逼铁原、涟川，志愿军后方基地受至严重威胁，并有主力被合围的迹象，彭德怀电令63军死守铁原。5月30日部队冒雨进入阵地，积极抢修工事，美军为突破铁原每天集结大量航空兵，坦克装甲兵，炮兵攻击志愿军阵地，铁原南面茂盛的森林全部被烧成光头，地面被凝固汽油弹烧焦，许多阵地打到最后一两个人时与敌同归于尽，一线部队全都拼了刺刀。6月12日63军完成狙击任务撤出战斗，全军战后仅1500多人接受彭德怀司令员的检阅，旋部队补进20000多新兵。\n　　(7)血战汉江\n　　第四次战役为保证东线的会战胜利完成，38军奉命在汉江南岸死守，自1月25日顶住美24师，骑一师，英27旅等数倍敌人的攻击，敌人凭借炮兵，坦克和空军的掩护下分七路进攻，经十几昼夜，38军付出巨大代价。重点扼守350.3高地的342团大战后，生还的仅几十人，相继守卫580高地的3个营及军警卫连等总计也只剩下几十人，牺牲及重伤者均为十之七八以上。至2月16号38军付出极大的代价，胜利完成的阻击任务，敌人全线攻势减退,至此五次战役结束。\n　　(8)血战上甘岭\n　　美韩为首的联合国军为争夺朝鲜中线门户于1952年10月14日向守卫的志愿军15军45师发起上甘岭战役，至20日仅一个星期45师伤亡50%以上，21个步兵连无一完整。联合国军17个营，伤亡达7000人以上，至11月15日联合国军无力再战，上甘岭战役宣告结束。志愿军伤亡20000人左右，联合国军伤亡10000人以上，3.8平方公里的土地完全被削平，被鲜血浸透。美军共发射190多万发炮弹，5000多枚航弹，志愿军发射40多万发炮弹。志愿军涌现了邱少云，孙占元，黄继光，孙占元等战斗英雄，激烈战斗中与敌同归于尽者比比皆是，后12军加入上甘岭的防守取得最后胜利。二等部队的45师基本上被打光，但从此昂首跨入志愿军一等主力行列，后被特别挑选改建中国第一空降军。\n　　1951年7月10日，中华人民共和国和朝鲜方面与联合国军代表开始停战谈判，经过多次谈判后，1953年7月27日签署《朝鲜停战协定》。\n"}
     * code : 200
     */

    private CheckDetailBean check_Detail;
    private int code;

    public CheckDetailBean getCheck_Detail() {
        return check_Detail;
    }

    public void setCheck_Detail(CheckDetailBean check_Detail) {
        this.check_Detail = check_Detail;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public static class CheckDetailBean implements Serializable {
        /**
         * title : 志愿军八大血战
         * img_url : http://www.todayonhistory.com/uploadfile/2016/0421/20160421045025833.jpg
         * detail : 　　抗美援朝战争为朝鲜战争之一部分，仅指中国人民志愿军参战的阶段。朝鲜战争原是朝鲜半岛上的朝韩之间的民族内战，后分别支持朝韩双方的美国、苏联、中国等多个国家不同程度地卷入这场战争。在经历了长期矛盾和冲突积累后，1950年6月25日朝鲜得到苏联默许进行统一战争，历时三年的朝鲜战争爆发。8月中旬，北朝鲜人民军将韩国军驱至釜山一隅，攻占了韩国90%的领土。9月15日，以美军为主的联合国军(美国、英国、加拿大、澳大利亚、新西兰、荷兰、法国、土耳其、泰国、菲律宾、希腊、比利时、哥伦比亚、埃塞俄比亚、南非、卢森堡)在仁川登陆，直接介入朝鲜战争，并将战火扩大至中国鸭绿江边。
         * 　　(1)血战飞虎山
         * 　　第二次战役根据彭德怀“诱敌深入”的计划，为了不让联合国军北进的速度太快而影响中国军队的调动和威胁中国军队的侧后，彭德怀命令112师335团依据飞虎山之险阻击联合国军。11月4日335团经过血战占领飞虎山，到11月8日部队完成阻击任务安全撤离，经过五昼夜的血战，防守部队承受着韩国第七师和美军一部的立体攻击，最激烈的8日毫无防空力量的志愿军承受80余架美机及大炮地毯式轰炸，所有阵地均进入了肉搏战，守卫飞虎山主阵地的335团2营阵亡者十之六七，其中五连三排仅余3名战斗人员。本次血战共毙伤俘敌1800余人，飞虎山前共有美韩军遗失400多具，335团及团长范天恩由此威名天下。
         * 　　(2)血战长津湖
         * 　　血战长津湖是在第二次战役以美军为首的联合国军猖狂北犯，11月底进到长津湖一带，志愿军第九兵团冒着零下30多度的严寒设置伏击圈，11月27日九兵团发起全线攻击，当时被包围的美国陆战一师约有四个团一万多人，超出预定一倍以下。到28日拂晓志愿军包围新兴里之敌，美国则凶猛地反扑，其中80师伤亡及冻饿减员十分严重，每团仅余数百人!故81师加入新兴里战斗，随着包围圈越来越小，美军突围一次比一次疯狂。当晚气温继续下降，美国全力向241团阵地发起冲击，其中241团3营8连战斗到仅剩最后一人，美军侥幸得以突围，志愿军只好分路截击，南逃美军在1221高地受至阻击分散而逃，至12月2日只有200多美军逃入柳潭里，至此美军31团，32团1营及第57炮兵营被27军基本被歼灭。二次战役中西线的长津之战以美陆1师的成建制撤退而告终，未能达到志司全歼美1师的设想。据美军战后统计，美陆1师战斗减员4418人，其中604人在战斗中阵亡，114人死于战伤，192人在战斗中失踪，3508人在作战中负伤，冻伤减员7313人，减员数达到了全师兵力的40%。加上美陆7师和其他部队的损失，美军战斗死伤达万余人。反观九兵团的损失，据官方公布的数字。九兵团战斗减员19202人，冻伤28954人，减员48156人，整个长津作战损失兵力达兵团总人数的三分之一。
         * 　　下碣里是美军全军的退路，志愿军58师奉命攻占此地，经过战斗至30日深夜全师不足12个连，只剩下1500人，仅有少量迫击炮支援的志愿军冒着美军密集的火力一波又一波，前赴后继，一度突入敌人防守的阵地，然而在突击过程中伤亡太大导致后援不继，在美军反击下突入阵地的战士全部牺牲!志愿军在战斗中所表现出的视死如归般的勇敢，令美军肃然起敬!美军在下碣里的防御得到加强后，德洞山口又成了双方争夺的焦点。12月3日柳潭里的陆战5团和7团主力陆续到达德洞山口，遂坦克开路飞机掩护，开始全线撤退。此后美军在退路上不断受到志愿军的攻击，但美军的优势装备得到很好的发挥，没有受阻，至陆战一师逃到真兴里后意味着他们逃离的包围圈，但九兵团不甘就此放过陆战一师，不顾一切代价，组织力量追歼，无奈11日陆战1师登船安全撤离。这是一场真正的鏖战，志愿军投入3个军12个师总兵力为15万人，冻伤达30000多人，冻死达4000多人，阵亡1.5万人，美军伤亡为7000人，其中阵亡及失踪为2500多人，冻伤减员为7300人。
         * 　　(3)血战三所里
         * 　　第二次战役美军受到志愿军的迎头痛击后，迅速南撤，三所里及龙源里是美军主力的唯一退路，38军113师强行军14小时疾进72.5公里穿插到三所里，同时师长江潮命337团抢占龙源里，这样切断美第九军的退路。美军为打通退路，动用飞机坦克疯狂空围，坚守松骨峰的335团一营三连最后仅五人生还。美军在三所里连续冲锋十数次均为打退，美军第9军见从三所里、龙源里突围无望,被迫遗弃大量辎重装备转向安州方向突围，后经安州、肃川退向平壤。但此战打出了38军王牌军的硬骨头风采，战后彭德怀特嘉奖38军，“万岁军”由此名扬天下。
         * 　　(4)血战横城
         * 　　第四次战役为遏制联合国军的猛烈攻势，彭总命在横城一带打击敌人，于是横城反击战于1951年2月11日晚展开，志愿集结四个军和人民军两个军团欲全歼韩国第五师和第八师。志愿军39军117师350团长途奔袭插到敌后方，12日美退下来的美2师一部和韩国第八师2个营进入伏击圈，战斗异常激烈，相当一部分志愿军弹药全部打光拚上了刺刀，前往支援美2师一个营进入了别一个伏击圈，至2月13日横城之战结束，韩国第八师3个团，韩第三师和第五师各一部，美2师一个营，美韩4个炮兵营被消灭，共计12000多人。此战狠狠教训了李奇微，事隔10多年以后，李奇微在回忆横城地区的作战时仍心有余悸。
         * 　　(5)血战砥平里
         * 　　第四次战役为保持全线不致崩溃，李奇微命第十军死守砥平里，防守砥平里的是美二师第二十三团(包括法国营在内有四个步兵营，以及一个炮兵营和一个坦克中队，总计6000人)，第三十八团为预备队，第九军，英第二十九旅，韩国第六师向砥平里和文幕里之间移动。志愿军攻击部队投入了来自三十九，四十，第十二军的三个军八个团，由40军199师统一指挥，2月13日晚砥平里开始受到志愿军的攻击.
         * 　　此后几天里，中国军队一往无前的一波接一波的攻击，无所畏惧，参加太平洋战争的美军望着踏着同伴尸体冲锋的中共部队非常恐惧，他们见到了比日军更不惜生命的部队，美国动用的大量航空兵，炮兵持续不断反反复复地轰炸志愿军的攻击方向，每平方米落下几十颗炸弹，鲜血染红的砥平里，一百多人的连队往往几分钟后仅剩七八人，战斗到最后的战士往往与反击的敌人同归于尽皆是，志愿军阵亡者应在5000人以上，仅40军三个团伤亡就达1830人，359团3营仅有数人生还，由于通讯不畅，敌我装备相差悬殊，没有炮兵航空兵只有简陋装备的志愿军装备最终无法突破美军的防线撤出战斗，但志愿军的英勇令敌手感到他们遇到了有世界第一勇气的部队。
         * 　　(6)血战铁原
         * 　　第五次第二阶段，以美军第一军为首的数万敌军突然直逼铁原、涟川，志愿军后方基地受至严重威胁，并有主力被合围的迹象，彭德怀电令63军死守铁原。5月30日部队冒雨进入阵地，积极抢修工事，美军为突破铁原每天集结大量航空兵，坦克装甲兵，炮兵攻击志愿军阵地，铁原南面茂盛的森林全部被烧成光头，地面被凝固汽油弹烧焦，许多阵地打到最后一两个人时与敌同归于尽，一线部队全都拼了刺刀。6月12日63军完成狙击任务撤出战斗，全军战后仅1500多人接受彭德怀司令员的检阅，旋部队补进20000多新兵。
         * 　　(7)血战汉江
         * 　　第四次战役为保证东线的会战胜利完成，38军奉命在汉江南岸死守，自1月25日顶住美24师，骑一师，英27旅等数倍敌人的攻击，敌人凭借炮兵，坦克和空军的掩护下分七路进攻，经十几昼夜，38军付出巨大代价。重点扼守350.3高地的342团大战后，生还的仅几十人，相继守卫580高地的3个营及军警卫连等总计也只剩下几十人，牺牲及重伤者均为十之七八以上。至2月16号38军付出极大的代价，胜利完成的阻击任务，敌人全线攻势减退,至此五次战役结束。
         * 　　(8)血战上甘岭
         * 　　美韩为首的联合国军为争夺朝鲜中线门户于1952年10月14日向守卫的志愿军15军45师发起上甘岭战役，至20日仅一个星期45师伤亡50%以上，21个步兵连无一完整。联合国军17个营，伤亡达7000人以上，至11月15日联合国军无力再战，上甘岭战役宣告结束。志愿军伤亡20000人左右，联合国军伤亡10000人以上，3.8平方公里的土地完全被削平，被鲜血浸透。美军共发射190多万发炮弹，5000多枚航弹，志愿军发射40多万发炮弹。志愿军涌现了邱少云，孙占元，黄继光，孙占元等战斗英雄，激烈战斗中与敌同归于尽者比比皆是，后12军加入上甘岭的防守取得最后胜利。二等部队的45师基本上被打光，但从此昂首跨入志愿军一等主力行列，后被特别挑选改建中国第一空降军。
         * 　　1951年7月10日，中华人民共和国和朝鲜方面与联合国军代表开始停战谈判，经过多次谈判后，1953年7月27日签署《朝鲜停战协定》。
         */

        private String title;
        private String img_url;
        private String detail;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getImg_url() {
            return img_url;
        }

        public void setImg_url(String img_url) {
            this.img_url = img_url;
        }

        public String getDetail() {
            return detail;
        }

        public void setDetail(String detail) {
            this.detail = detail;
        }
    }
}
