package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/8.
 */

public class HistoryWarDetail implements Serializable {


    /**
     * china_History_Olden_War_Detail : {"id":1,"name":"中文名称：一二九运动","army":"参战部队：爱国学生、各界爱国人士","result":"战争结果：形成了全国人民抗日民主运动的新高潮","time":"时　　间：1935年12月9日","address":"地　　点：中国","figure":"人　　物：北平学生 爱国人士 ","war_detail":"　　走上街头\n　　1935年12月9日凌晨，广大爱国学生的抗日怒火像火山一样爆发。东北大学、中国大学、北平师范大学等校学生举着大旗和标语，分别朝着新华门进发。清华大学和燕京大学近千名爱国学生离城较远，到达西直门时，城门已被军警关闭，请愿队伍无法进城。两校学生就在西直门一带召开群众大会，向附近居民和守城军警进行抗日宣传。\n　　上午10点半，新华门前汇集了中国大学、北平师范大学、东北大学等十多所学校1000多人的请愿队伍。新华门紧闭着，门前排列着警车和架着机关枪的摩托车，军警宪兵手持刀枪杀气腾腾。请愿学生高举着旗帜，手持标语，高呼抗日救国口号。推选董毓华、宋黎和于刚等12人为代表，要求面见何应钦，并提出反对华北成立防共自治委员会、停止内战、立即释放被捕学生等6项要求。上午11时，何应钦的秘书侯成出来与学生会面，对学生提出的要求一味敷衍搪塞，为国民党对日妥协对内反共政策百般狡辩。同学们对其答复极为愤慨，振臂高呼\u201c打倒卖国贼\u201d，\u201c请愿不成，我们示威游行去\u201d，宋黎被推举为游行队伍的总指挥。\n　　当游行队伍行至西单牌楼平津卫戍司令部附近时，遇到军警的阻拦和袭击。同学们不畏强暴，高呼抗日救国口号，继续前进，队伍也越来越壮大。北京大学的许德珩、中国大学的吴承仕等教授和当时在燕京大学任教的斯诺夫妇也参加了游行示威。国内外许多报社的记者随行采访。队伍经西四、护国寺、地安门、沙滩抵达王府井大街时，已扩大到四五千人。王府井大街南口布满了军警，挥舞皮鞭、木棍，凶狠地抽打手无寸铁的爱国学生。同学们与军警展开了搏斗，当场有数十人被捕。在国民党当局的血腥镇压下，游行示威队伍被冲散了。\n　　救亡怒潮\n　　\u201c一二·九\u201d的抗日怒吼，震撼了古都北平，很快传遍了国内外。中共北平市临时工委、北平市学联及时总结，对下一步行动进行部署。12月11日，全市各大中学校学生联合起来罢课。国民党当局对北平学生的爱国行动极为恐慌，下令严禁学生的爱国行为，还派军警封锁一些重点学校。但爱国学生的抗日烈火是扑不灭的。中共北平临时工委获知国民党当局不顾广大人民群众的强烈反对，决定在12月16日成立\u201c冀察政务委员会\u201d，决定在这一天举行更大规模的示威游行。\n　　12月16日凌晨，1万余名北平爱国学生陆续走上街头，一场声势浩大的抗日救亡大示威爆发了。示威游行队伍共分为4个大队，分别由东北大学、中国大学、北京大学、清华大学率领从不同方向前进，途中冲破军警的封锁阻拦，最后在天桥会合。上午11时许，北平爱国学生和广大工人、农民、市民3万余人在天桥召开市民大会。会场旗帜飘扬，\u201c打倒日本帝国主义！\u201d\u201c打倒汉奸卖国贼!\u201d\u201c反对成立冀察政务委员会!\u201d的口号声此起彼伏，响彻天空。市民大会结束后，1万多名爱国学生整队向前门方向行进。学生们手挽着手，不断高呼抗日救国口号，向街道两旁的市民和行人散发传单。市民们热情支持学生的爱国行动，有的送来开水和食物，有的自动加入了游行队伍。\n　　游行队伍抵达前门时，遇到大批军警和保安队的阻截，爱国学生就在前门火车站广场举行第二次市民大会。大会决定继续进内城示威游行，并派代表与军警交涉，要求打开城门。当局为了分割示威游行队伍，答应让一部分学生从前门进城，但大部分学生须从和平门和宣武门入城。下午4时，黄敬率北京大学、中国大学等校部分同学由前门入城后，城门马上关闭了。清华大学、燕京大学、东北大学、北平大学等校同学沿着西河沿赴和平门和宣武门。但城门都已紧闭，同学们多次试图撞开城门，均未成功。后来几经交涉，军警答应以清华、燕京大学的队伍先撤走为条件，可以打开城门让其他学校的学生入城。此时已是晚上9点多钟，当两校队伍离开后，城外四周的路灯全部熄灭，大批军警挥刀舞棍从四面八方向学生扑过来，许多人遭到毒打。由前门入城的学生想去宣武门接应，当走到西单绒线胡同西口时，遭到大批军警扑打，数十名学生被砍伤，街道上血迹斑斑，惨不忍睹。在\u201c一二·一六\u201d大示威中，全市学生共有22人被捕，300余人受伤，再一次暴露了反动当局的凶残面目。\n　　声援北平\n　　北平学生的爱国斗争，打击了日本帝国主义的嚣张气焰，揭露了国民党当局的卖国行径，得到了各界爱国人士的支持响应，促进了抗日救亡运动的开展。\n　　12月18日全天，北京大学、清华大学等6所大学的校长，联名要求释放被捕学生。同日，中华全国总工会向全国工人紧急呼吁援助学生救国运动，各地工人纷纷举行罢工，支持学生斗争。20日，共青团中央发表宣言，号召青年学生深入到工农群众中扩大抗日救国运动。各地社团组织纷纷发表通电和宣言，声援北平学生爱国运动。宋庆龄、鲁迅、马相伯、沈钧儒、王造时、邹韬奋、陶行知、章乃器、李公朴、史良等爱国知名人士纷纷表示支持。宋庆龄从上海寄给北平学联100多元钱，作为开展抗日救国工作的费用。鲁迅于12月18日至19日夜，撰文热情赞扬爱国学生的英勇斗争精神，并寄以\u201c石在，火种是不会绝的\u201d殷切希望。12月26日，陕甘苏区各界民众举行集会，声援北平和各地学生的抗日救国运动。在北平学生爱国运动的影响下，全国各地学生群起响应。一时间，在黄河两岸，大江南北，到处响彻抗日救亡的号角。\n　　两次游行示威之后，在党的领导下，北平学联成立了南下扩大宣传团，深入工厂农村，发动各地工农士兵群众开展反日反蒋斗争，也使爱国学生们得到了锻炼和教育。1936年，南下扩大宣传团在北平召开团员代表大会，正式成立了民族解放先锋队（后改名中华民族解放先锋队），这是党领导成立的先进青年组织。它的诞生和发展，大大推动了\u201c一二·九\u201d运动的深入发展。\n　　在中国共产党的领导和号召下，由北平爱国学生首倡，迅速席卷全国的\u201c一二·九\u201d运动，极大地促进了中国人民的觉醒，标志着中国人民抗日民主运动新高潮的到来。\n　　大会通过了反对冀察政务委员会，反对华北任何傀儡组织，要求停止内战、一致对外，收复东北失地，争取抗日和爱国自由等8个决议案。会后，游行队伍奔向冀察政务委员会预定成立的地点\u2014\u2014东交民巷口的外交大楼举行总示威。队伍走到前门，遭到大批警察和保安队的拦截。经学生代表反复交涉，军警才让游行队伍分批分别由前门和宣武门进入内城。在宣武门，爱国学生遭到上千名军警的血腥镇压，有二三十人被捕，近400人受伤。北平学生的抗日救国示威游行，沉重地打击了国民党政府的卖国活动，迫使冀察政务委员会不得不延期成立。一二九运动得到全国人民的支持和响应。天津、上海、南京、武汉、广州、杭州、西安、开封、济南、太原、长沙、桂林、重庆等城市的爱国学生举行请愿集会、示威游行，或发表宣言、通电，声援北平学生的爱国行动。陕甘苏区学生联合会也发出响应的通电，苏区各界民众集会声援全国各地学生的抗日救国运动。12月18日，中华全国总工会发表《为援助北平学生救国运动告工友书》，号召全国各业、各厂的男女工友起来召集群众会议，发表宣言和通电，抗议汉奸卖国贼出卖华北与屠杀、逮捕爱国学生。12月21日，上海市总工会通电声援北平学生，呼吁全国同胞一致兴起，集合民族整个的力量，反对任何伪组织之存在，以维护主权而保国土。广州铁路工人、上海邮务、铁路工人举行集会，发通电，要求对日宣战。鲁迅、宋庆龄等爱国知名人士赞扬爱国学生的英勇奋斗精神，捐款支持学生抗日救国运动。海外华侨也以各种方式支援爱国学生。一二九运动广泛地宣传了中国共产党与国民党停止内战、一致对外的抗日主张，掀起了全国抗日救国运动的新高潮。\n"}
     * code : 200
     */

    private ChinaHistoryOldenWarDetailBean china_History_Olden_War_Detail;
    private int code;

    public ChinaHistoryOldenWarDetailBean getChina_History_Olden_War_Detail() {
        return china_History_Olden_War_Detail;
    }

    public void setChina_History_Olden_War_Detail(ChinaHistoryOldenWarDetailBean china_History_Olden_War_Detail) {
        this.china_History_Olden_War_Detail = china_History_Olden_War_Detail;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public static class ChinaHistoryOldenWarDetailBean implements Serializable{
        /**
         * id : 1
         * name : 中文名称：一二九运动
         * army : 参战部队：爱国学生、各界爱国人士
         * result : 战争结果：形成了全国人民抗日民主运动的新高潮
         * time : 时　　间：1935年12月9日
         * address : 地　　点：中国
         * figure : 人　　物：北平学生 爱国人士
         * war_detail : 　　走上街头
         　　1935年12月9日凌晨，广大爱国学生的抗日怒火像火山一样爆发。东北大学、中国大学、北平师范大学等校学生举着大旗和标语，分别朝着新华门进发。清华大学和燕京大学近千名爱国学生离城较远，到达西直门时，城门已被军警关闭，请愿队伍无法进城。两校学生就在西直门一带召开群众大会，向附近居民和守城军警进行抗日宣传。
         　　上午10点半，新华门前汇集了中国大学、北平师范大学、东北大学等十多所学校1000多人的请愿队伍。新华门紧闭着，门前排列着警车和架着机关枪的摩托车，军警宪兵手持刀枪杀气腾腾。请愿学生高举着旗帜，手持标语，高呼抗日救国口号。推选董毓华、宋黎和于刚等12人为代表，要求面见何应钦，并提出反对华北成立防共自治委员会、停止内战、立即释放被捕学生等6项要求。上午11时，何应钦的秘书侯成出来与学生会面，对学生提出的要求一味敷衍搪塞，为国民党对日妥协对内反共政策百般狡辩。同学们对其答复极为愤慨，振臂高呼“打倒卖国贼”，“请愿不成，我们示威游行去”，宋黎被推举为游行队伍的总指挥。
         　　当游行队伍行至西单牌楼平津卫戍司令部附近时，遇到军警的阻拦和袭击。同学们不畏强暴，高呼抗日救国口号，继续前进，队伍也越来越壮大。北京大学的许德珩、中国大学的吴承仕等教授和当时在燕京大学任教的斯诺夫妇也参加了游行示威。国内外许多报社的记者随行采访。队伍经西四、护国寺、地安门、沙滩抵达王府井大街时，已扩大到四五千人。王府井大街南口布满了军警，挥舞皮鞭、木棍，凶狠地抽打手无寸铁的爱国学生。同学们与军警展开了搏斗，当场有数十人被捕。在国民党当局的血腥镇压下，游行示威队伍被冲散了。
         　　救亡怒潮
         　　“一二·九”的抗日怒吼，震撼了古都北平，很快传遍了国内外。中共北平市临时工委、北平市学联及时总结，对下一步行动进行部署。12月11日，全市各大中学校学生联合起来罢课。国民党当局对北平学生的爱国行动极为恐慌，下令严禁学生的爱国行为，还派军警封锁一些重点学校。但爱国学生的抗日烈火是扑不灭的。中共北平临时工委获知国民党当局不顾广大人民群众的强烈反对，决定在12月16日成立“冀察政务委员会”，决定在这一天举行更大规模的示威游行。
         　　12月16日凌晨，1万余名北平爱国学生陆续走上街头，一场声势浩大的抗日救亡大示威爆发了。示威游行队伍共分为4个大队，分别由东北大学、中国大学、北京大学、清华大学率领从不同方向前进，途中冲破军警的封锁阻拦，最后在天桥会合。上午11时许，北平爱国学生和广大工人、农民、市民3万余人在天桥召开市民大会。会场旗帜飘扬，“打倒日本帝国主义！”“打倒汉奸卖国贼!”“反对成立冀察政务委员会!”的口号声此起彼伏，响彻天空。市民大会结束后，1万多名爱国学生整队向前门方向行进。学生们手挽着手，不断高呼抗日救国口号，向街道两旁的市民和行人散发传单。市民们热情支持学生的爱国行动，有的送来开水和食物，有的自动加入了游行队伍。
         　　游行队伍抵达前门时，遇到大批军警和保安队的阻截，爱国学生就在前门火车站广场举行第二次市民大会。大会决定继续进内城示威游行，并派代表与军警交涉，要求打开城门。当局为了分割示威游行队伍，答应让一部分学生从前门进城，但大部分学生须从和平门和宣武门入城。下午4时，黄敬率北京大学、中国大学等校部分同学由前门入城后，城门马上关闭了。清华大学、燕京大学、东北大学、北平大学等校同学沿着西河沿赴和平门和宣武门。但城门都已紧闭，同学们多次试图撞开城门，均未成功。后来几经交涉，军警答应以清华、燕京大学的队伍先撤走为条件，可以打开城门让其他学校的学生入城。此时已是晚上9点多钟，当两校队伍离开后，城外四周的路灯全部熄灭，大批军警挥刀舞棍从四面八方向学生扑过来，许多人遭到毒打。由前门入城的学生想去宣武门接应，当走到西单绒线胡同西口时，遭到大批军警扑打，数十名学生被砍伤，街道上血迹斑斑，惨不忍睹。在“一二·一六”大示威中，全市学生共有22人被捕，300余人受伤，再一次暴露了反动当局的凶残面目。
         　　声援北平
         　　北平学生的爱国斗争，打击了日本帝国主义的嚣张气焰，揭露了国民党当局的卖国行径，得到了各界爱国人士的支持响应，促进了抗日救亡运动的开展。
         　　12月18日全天，北京大学、清华大学等6所大学的校长，联名要求释放被捕学生。同日，中华全国总工会向全国工人紧急呼吁援助学生救国运动，各地工人纷纷举行罢工，支持学生斗争。20日，共青团中央发表宣言，号召青年学生深入到工农群众中扩大抗日救国运动。各地社团组织纷纷发表通电和宣言，声援北平学生爱国运动。宋庆龄、鲁迅、马相伯、沈钧儒、王造时、邹韬奋、陶行知、章乃器、李公朴、史良等爱国知名人士纷纷表示支持。宋庆龄从上海寄给北平学联100多元钱，作为开展抗日救国工作的费用。鲁迅于12月18日至19日夜，撰文热情赞扬爱国学生的英勇斗争精神，并寄以“石在，火种是不会绝的”殷切希望。12月26日，陕甘苏区各界民众举行集会，声援北平和各地学生的抗日救国运动。在北平学生爱国运动的影响下，全国各地学生群起响应。一时间，在黄河两岸，大江南北，到处响彻抗日救亡的号角。
         　　两次游行示威之后，在党的领导下，北平学联成立了南下扩大宣传团，深入工厂农村，发动各地工农士兵群众开展反日反蒋斗争，也使爱国学生们得到了锻炼和教育。1936年，南下扩大宣传团在北平召开团员代表大会，正式成立了民族解放先锋队（后改名中华民族解放先锋队），这是党领导成立的先进青年组织。它的诞生和发展，大大推动了“一二·九”运动的深入发展。
         　　在中国共产党的领导和号召下，由北平爱国学生首倡，迅速席卷全国的“一二·九”运动，极大地促进了中国人民的觉醒，标志着中国人民抗日民主运动新高潮的到来。
         　　大会通过了反对冀察政务委员会，反对华北任何傀儡组织，要求停止内战、一致对外，收复东北失地，争取抗日和爱国自由等8个决议案。会后，游行队伍奔向冀察政务委员会预定成立的地点——东交民巷口的外交大楼举行总示威。队伍走到前门，遭到大批警察和保安队的拦截。经学生代表反复交涉，军警才让游行队伍分批分别由前门和宣武门进入内城。在宣武门，爱国学生遭到上千名军警的血腥镇压，有二三十人被捕，近400人受伤。北平学生的抗日救国示威游行，沉重地打击了国民党政府的卖国活动，迫使冀察政务委员会不得不延期成立。一二九运动得到全国人民的支持和响应。天津、上海、南京、武汉、广州、杭州、西安、开封、济南、太原、长沙、桂林、重庆等城市的爱国学生举行请愿集会、示威游行，或发表宣言、通电，声援北平学生的爱国行动。陕甘苏区学生联合会也发出响应的通电，苏区各界民众集会声援全国各地学生的抗日救国运动。12月18日，中华全国总工会发表《为援助北平学生救国运动告工友书》，号召全国各业、各厂的男女工友起来召集群众会议，发表宣言和通电，抗议汉奸卖国贼出卖华北与屠杀、逮捕爱国学生。12月21日，上海市总工会通电声援北平学生，呼吁全国同胞一致兴起，集合民族整个的力量，反对任何伪组织之存在，以维护主权而保国土。广州铁路工人、上海邮务、铁路工人举行集会，发通电，要求对日宣战。鲁迅、宋庆龄等爱国知名人士赞扬爱国学生的英勇奋斗精神，捐款支持学生抗日救国运动。海外华侨也以各种方式支援爱国学生。一二九运动广泛地宣传了中国共产党与国民党停止内战、一致对外的抗日主张，掀起了全国抗日救国运动的新高潮。

         */

        private int id;
        private String name;
        private String army;
        private String result;
        private String time;
        private String address;
        private String figure;
        private String war_detail;

        public int getId() {
            return id;
        }

        public void setId(int id) {
            this.id = id;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getArmy() {
            return army;
        }

        public void setArmy(String army) {
            this.army = army;
        }

        public String getResult() {
            return result;
        }

        public void setResult(String result) {
            this.result = result;
        }

        public String getTime() {
            return time;
        }

        public void setTime(String time) {
            this.time = time;
        }

        public String getAddress() {
            return address;
        }

        public void setAddress(String address) {
            this.address = address;
        }

        public String getFigure() {
            return figure;
        }

        public void setFigure(String figure) {
            this.figure = figure;
        }

        public String getWar_detail() {
            return war_detail;
        }

        public void setWar_detail(String war_detail) {
            this.war_detail = war_detail;
        }

        @Override
        public String toString() {
            return "ChinaHistoryOldenWarDetailBean{" +
                    "id=" + id +
                    ", name='" + name + '\'' +
                    ", army='" + army + '\'' +
                    ", result='" + result + '\'' +
                    ", time='" + time + '\'' +
                    ", address='" + address + '\'' +
                    ", figure='" + figure + '\'' +
                    ", war_detail='" + war_detail + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "HistoryWarDetail{" +
                "china_History_Olden_War_Detail=" + china_History_Olden_War_Detail +
                ", code=" + code +
                '}';
    }
}
