package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/12/8.
 */

public class HistoryWarDetail implements Serializable {

    /**
     * china_History_Olden_War_Detail : {"detail_url":"http://www.todayonhistory.com/lishi/201510/10.html","name":"中文名称：城濮之战","army":"参战部队：晋、齐、秦、宋；楚、陈、蔡、许、郑","result":"战争结果：晋方胜利，在践土举行胜利会盟；楚军退回本国，成得臣自杀。","time":"时　　间：前632年春季4月","address":"地　　点：城濮（今山东鄄城县）","figure":"人　　物：胥臣楚 成得臣 赵衰 栾枝 ","war_detail":"　　城濮之战是继齐、楚召陵之盟和宋、楚泓之战以后，晋国与楚国之间的一场大战，在春秋历史上具有重大意义。它扼制了楚国的北进势头，稳定了中原形势，成就了晋国的中原霸主地位。关于城濮战前的形势，我们在第一章中已作了交代。泓之战后，中原列国郑、许、陈、蔡、鲁、卫、曹、宋等都已拜倒在楚国的军威之下，楚成王又攻占齐国谷地（山东省东阿县），拥立公子雍，造成对齐国的威胁。当时，楚国可以说是势力强盛、声威方张。晋国自文公即位以来，对内整顿内政，发展经济，壮大军旅，对外尊崇王室，联络齐、秦，以与楚国针锋相对，争夺中原霸权。晋、楚之战势在难免。这是城濮之战的根本原因。\n　　城濮之战的直接原因是晋援宋拒楚。周襄王十八年（公元前634　年），宋成公因为其父襄公当年善待过晋文公，与文公有旧交，遂\"叛楚即晋\"。冬，楚成王命令尹子玉、司马子西率军伐宋，包围缗（mín，音民）邑（在山东省金乡县东北）。次年冬，楚率陈、蔡、郑、许五国军队包围宋国，宋国向晋告急。晋中军元帅先轸说：\"报施救患，取威定霸，于是乎在矣。\"晋文公采纳先轸建议，准备起兵救宋。他在被庐检阅军队，扩编三军，任命了将佐，从而拉开了城濮之战的序幕。\n　　晋国君臣十分重视这次军事行动，确定了政治、外交与军事总体战的方针。在军事上，决定不直接救宋，而首先讨伐曹、卫。因为\"楚始得曹而新婚于卫，若伐曹、卫，楚必救之，则齐、宋免矣。\"这一着制敌方案，既可引诱楚师北上，又可坐收以逸待劳之功。周襄王二十年（公元前632　年）春，晋国出动三军、战车七百乘伐曹，借道于卫，卫人不允许。晋军遂绕道南下，在南河（河南省淇县南）渡过黄河。正月初九，攻取卫国的五鹿。并挥师东进，攻占敛盂（在河南濮阳东南），遣使至齐国通好。二月，晋文公与齐孝公结盟，成功地把齐国拉到了自己一边。卫侯见晋大军压境，晋、齐又结为盟好，请求参加结盟，晋文公不答应。卫侯又想亲近楚国，国人不同意，就驱逐了卫侯。晋军不战而得卫国。\n　　战前，鲁国追随楚国。在晋军攻卫时，鲁曾派公子买帮助戍守卫国。\n　　现见晋军势大，卫侯逃亡，而楚国救卫没有成功，鲁国便召回公子买而杀了他。一面向晋国报告说他擅自兴兵，另一面又向楚国报告说他没有完成防守任务，玩弄两面手法，坐待投靠胜利者。三月，晋军南下攻曹。十二日，攻入曹都（山东定陶）。\n　　晋军攻击曹、卫，本欲引诱楚军北上。但楚军并不上钩，而猛攻宋国，宋再次向晋军告急。晋军若南下救宋，诱楚北上之战略意图则无法贯彻。若不南下救宋，必失掉宋国，陷于战略被动地位。面对这种形势，晋大夫先轸又建议：让宋国使者去贿赂齐、秦二国，使齐、秦劝楚退兵。晋则捉住曹共公，分曹、卫的田地给宋人，以激怒楚国人，逼其不听齐、秦的劝解。齐、秦劝楚不成，必然坚定了站在晋国一边的立场，决定出兵对楚作战。这是晋走出的第二着高棋。\n　　楚成王见晋军破曹降卫，与齐、秦结成了联盟，中原形势已变，就退回申邑（在河南南阳市），命令大夫申叔撤出攻占齐国的谷邑，命令令尹子玉撤回围宋的军队，并告诫子玉说：\"无从晋师！晋侯在外，十九年矣，而果得晋国，险阻艰难，备尝之矣。民之情伪，尽知之矣。\"又说：\"《军志》曰：'允当则归'。又曰：'知难而退'。又曰：'有德不可敌'。\"但楚令尹子玉一向骄傲，不听楚成王劝告，指派伯棼赴申邑向楚成王请求出战，楚成王一怒之下率王师回国，只给子玉留下了西广、东宫、若敖之六卒的军队。这里的若敖之六卒有些许争议，一说一卒一百人，一说一卒为兵车三十乘。但若为后者，若敖一族便有一百八十乘兵力，晋国全国主力也只有七百乘，与楚王\u201c少与之师\u201d不符。\n　　子玉他派宛春赴晋军说：\"请复卫侯而封曹，臣亦释宋之围。\"子玉虽然狂傲，但身为楚国令尹，也并非无谋之辈，他的这个计划就是一石三鸟之策。如果晋答应他的要求，则曹、卫、宋三国都会感戴楚国。如果晋不答应他的要求，那么曹、卫、宋三国将会怨恨晋国。晋大夫子犯即上了子玉的圈套，说：\"子玉无礼哉！君取一，臣取二，不可失矣，\"主张拒绝子玉的建议。但晋中军帅先轸则识破了子玉的机关，说：\"子与之！定人之谓礼。楚一言而定三国，我一言而亡之。我则无礼，何以战乎？\"于是，晋国私下答应恢复曹、卫，让他们断绝与楚国的关系，而扣留楚使宛春以激怒子玉。这是晋国走出的第三着高棋。一向狂傲自大的子玉不能忍受这种刺激，冒然率军北上攻击晋军，终于被晋军牵上了鼻子。\n　　当初，晋文公以公子身份颠沛流离时，曾路过楚国，受到楚成王的款待。酒席宴上，成王问文公：\"公子若反晋国，则何以报不谷？\"文公回答道：\"若以君之灵，得反晋国。晋楚治兵，遇于中原，其辟君三舍（三十里一舍）。\"这次，文公果然实践诺言，面对楚军的进攻，命令自曹国后撤三舍，与宋、齐、秦三国军队一同驻扎在城濮（山东省范县南）。子玉率军急进，依托丘陵险阻扎营，两军对峙于城濮。晋文公退避三舍，既是报答以前楚成王给予的礼遇，也是运用\"卑而骄之\"、\"怒而挠之\"的诱敌之计，子玉再次上钩。\n　　楚子玉派大将斗勃向晋文公请战说：\"请与君之士戏，君凭轼而观之，得臣（子玉名）与寓目焉，\"晋栾枝答词却相当谦恭：\"寡君闻命矣。楚君之惠，未之敢忘，是以在此。为大夫退，其敢当君乎？既不获命，敢烦大夫谓二三子：戒尔车乘，敬尔君事，诘朝相见。\"\n　　城濮交战时双方的阵容是：晋三军，即先轸为元帅，统率中军，郤溱辅佐，狐毛统率上军，狐偃辅佐。栾枝统率下军，胥臣辅佐。楚国也是三军，即令尹子玉以若敖之六卒统率中军。子西（斗宜申）统率左军。子上（斗勃）统率右军。楚的仆从国郑、许军附属楚左军，陈、蔡军附属楚右军。\n　　四月六日，晋军在城濮严阵以待楚军。子玉狂傲声称：\"日必无晋矣。\"当两军接触之时，晋下军佐胥臣率所部用虎皮蒙在马身上，首先冲击楚右翼的陈、蔡军，陈、蔡军惊骇逃散，楚右军溃败。楚子玉、子上见右军溃败，怒火中烧，加强对晋中军和上军的攻势。晋右翼上军狐毛设将、佐二面旗帜，令二旗后退，引诱楚军。晋下军栾枝所部也以车辆曳树枝奔驰而伪装后退。楚子玉以为晋右翼败退，令楚左军追击，所以对陈、蔡及右翼军溃败并未理会。楚左军追击晋上军时，侧翼暴露，晋先轸、郤溱率中军拦腰截击，狐毛、狐偃率上军夹攻楚左军，楚左军溃败。楚子玉见左、右军皆败，遂下令中军停止进攻，得以不败。子玉率残兵退出战场，晋军进占楚军营地，休整三日后，胜利班师。\n　　城濮一战使晋文公建立了霸权，楚国北进锋芒受到挫折，被迫退回桐柏山、大别山以南地区。中原诸侯无不朝宗晋国。\n　　在城濮之战中，宋、齐、秦的军队虽然到了城濮，但未参加实际战斗。晋国以战车七百乘、五万多兵力击败楚、陈、蔡、郑、许五国联军十余万众，是一次以少胜多的战役。（此处并无证据证明楚军真实兵力比晋国多。十余万仅是后人猜测，切尚有争议）晋国的胜利在于，认识到楚是强敌，君臣团结一心，在政治、外交、军事上，周密策划，牢牢掌握着战争的主动权，所以终于击败了楚国。楚国则不然。楚自战胜宋襄公以来，中原诸侯无一能敌，官兵上下已养成一片虚骄之气。子玉虽为一代枭将，不但不能革除积弊，反而更加骄狂。面对这样的大战，竟意气用事，掉以轻心，结果被人牵了鼻子，导致战争失败。楚成王得到楚军败报，派人指责子玉说：\"大夫若入，其若申息之老何？\"子玉羞愤自杀。\n　　四月二十七日，晋军进入郑国衡雍（河南原阳县西，当时在黄河南岸），并在践土（距衡雍较近，当时亦在黄河南岸，在河南花园口黄河北岸）修筑王的行宫，向襄王献俘。周襄王策命晋文公为\"侯伯\"。晋文公要求诸侯\"皆奖王室，无相害也。有渝此盟，明神殛之，无克祚国\"。晋文公在\"尊王\"的旗帜下，顺理成章地登上了霸主宝座。\n"}
     * code : 200
     */

    private ChinaHistoryOldenWarDetailBean china_History_Olden_War_Detail;
    private int code;

    public ChinaHistoryOldenWarDetailBean getChina_History_Olden_War_Detail() {
        return china_History_Olden_War_Detail;
    }

    public void setChina_History_Olden_War_Detail(ChinaHistoryOldenWarDetailBean china_History_Olden_War_Detail) {
        this.china_History_Olden_War_Detail = china_History_Olden_War_Detail;
    }

    public int getCode() {
        return code;
    }

    public void setCode(int code) {
        this.code = code;
    }

    public static class ChinaHistoryOldenWarDetailBean implements Serializable {
        /**
         * detail_url : http://www.todayonhistory.com/lishi/201510/10.html
         * name : 中文名称：城濮之战
         * army : 参战部队：晋、齐、秦、宋；楚、陈、蔡、许、郑
         * result : 战争结果：晋方胜利，在践土举行胜利会盟；楚军退回本国，成得臣自杀。
         * time : 时　　间：前632年春季4月
         * address : 地　　点：城濮（今山东鄄城县）
         * figure : 人　　物：胥臣楚 成得臣 赵衰 栾枝
         * war_detail : 　　城濮之战是继齐、楚召陵之盟和宋、楚泓之战以后，晋国与楚国之间的一场大战，在春秋历史上具有重大意义。它扼制了楚国的北进势头，稳定了中原形势，成就了晋国的中原霸主地位。关于城濮战前的形势，我们在第一章中已作了交代。泓之战后，中原列国郑、许、陈、蔡、鲁、卫、曹、宋等都已拜倒在楚国的军威之下，楚成王又攻占齐国谷地（山东省东阿县），拥立公子雍，造成对齐国的威胁。当时，楚国可以说是势力强盛、声威方张。晋国自文公即位以来，对内整顿内政，发展经济，壮大军旅，对外尊崇王室，联络齐、秦，以与楚国针锋相对，争夺中原霸权。晋、楚之战势在难免。这是城濮之战的根本原因。
         * 　　城濮之战的直接原因是晋援宋拒楚。周襄王十八年（公元前634　年），宋成公因为其父襄公当年善待过晋文公，与文公有旧交，遂"叛楚即晋"。冬，楚成王命令尹子玉、司马子西率军伐宋，包围缗（mín，音民）邑（在山东省金乡县东北）。次年冬，楚率陈、蔡、郑、许五国军队包围宋国，宋国向晋告急。晋中军元帅先轸说："报施救患，取威定霸，于是乎在矣。"晋文公采纳先轸建议，准备起兵救宋。他在被庐检阅军队，扩编三军，任命了将佐，从而拉开了城濮之战的序幕。
         * 　　晋国君臣十分重视这次军事行动，确定了政治、外交与军事总体战的方针。在军事上，决定不直接救宋，而首先讨伐曹、卫。因为"楚始得曹而新婚于卫，若伐曹、卫，楚必救之，则齐、宋免矣。"这一着制敌方案，既可引诱楚师北上，又可坐收以逸待劳之功。周襄王二十年（公元前632　年）春，晋国出动三军、战车七百乘伐曹，借道于卫，卫人不允许。晋军遂绕道南下，在南河（河南省淇县南）渡过黄河。正月初九，攻取卫国的五鹿。并挥师东进，攻占敛盂（在河南濮阳东南），遣使至齐国通好。二月，晋文公与齐孝公结盟，成功地把齐国拉到了自己一边。卫侯见晋大军压境，晋、齐又结为盟好，请求参加结盟，晋文公不答应。卫侯又想亲近楚国，国人不同意，就驱逐了卫侯。晋军不战而得卫国。
         * 　　战前，鲁国追随楚国。在晋军攻卫时，鲁曾派公子买帮助戍守卫国。
         * 　　现见晋军势大，卫侯逃亡，而楚国救卫没有成功，鲁国便召回公子买而杀了他。一面向晋国报告说他擅自兴兵，另一面又向楚国报告说他没有完成防守任务，玩弄两面手法，坐待投靠胜利者。三月，晋军南下攻曹。十二日，攻入曹都（山东定陶）。
         * 　　晋军攻击曹、卫，本欲引诱楚军北上。但楚军并不上钩，而猛攻宋国，宋再次向晋军告急。晋军若南下救宋，诱楚北上之战略意图则无法贯彻。若不南下救宋，必失掉宋国，陷于战略被动地位。面对这种形势，晋大夫先轸又建议：让宋国使者去贿赂齐、秦二国，使齐、秦劝楚退兵。晋则捉住曹共公，分曹、卫的田地给宋人，以激怒楚国人，逼其不听齐、秦的劝解。齐、秦劝楚不成，必然坚定了站在晋国一边的立场，决定出兵对楚作战。这是晋走出的第二着高棋。
         * 　　楚成王见晋军破曹降卫，与齐、秦结成了联盟，中原形势已变，就退回申邑（在河南南阳市），命令大夫申叔撤出攻占齐国的谷邑，命令令尹子玉撤回围宋的军队，并告诫子玉说："无从晋师！晋侯在外，十九年矣，而果得晋国，险阻艰难，备尝之矣。民之情伪，尽知之矣。"又说："《军志》曰：'允当则归'。又曰：'知难而退'。又曰：'有德不可敌'。"但楚令尹子玉一向骄傲，不听楚成王劝告，指派伯棼赴申邑向楚成王请求出战，楚成王一怒之下率王师回国，只给子玉留下了西广、东宫、若敖之六卒的军队。这里的若敖之六卒有些许争议，一说一卒一百人，一说一卒为兵车三十乘。但若为后者，若敖一族便有一百八十乘兵力，晋国全国主力也只有七百乘，与楚王“少与之师”不符。
         * 　　子玉他派宛春赴晋军说："请复卫侯而封曹，臣亦释宋之围。"子玉虽然狂傲，但身为楚国令尹，也并非无谋之辈，他的这个计划就是一石三鸟之策。如果晋答应他的要求，则曹、卫、宋三国都会感戴楚国。如果晋不答应他的要求，那么曹、卫、宋三国将会怨恨晋国。晋大夫子犯即上了子玉的圈套，说："子玉无礼哉！君取一，臣取二，不可失矣，"主张拒绝子玉的建议。但晋中军帅先轸则识破了子玉的机关，说："子与之！定人之谓礼。楚一言而定三国，我一言而亡之。我则无礼，何以战乎？"于是，晋国私下答应恢复曹、卫，让他们断绝与楚国的关系，而扣留楚使宛春以激怒子玉。这是晋国走出的第三着高棋。一向狂傲自大的子玉不能忍受这种刺激，冒然率军北上攻击晋军，终于被晋军牵上了鼻子。
         * 　　当初，晋文公以公子身份颠沛流离时，曾路过楚国，受到楚成王的款待。酒席宴上，成王问文公："公子若反晋国，则何以报不谷？"文公回答道："若以君之灵，得反晋国。晋楚治兵，遇于中原，其辟君三舍（三十里一舍）。"这次，文公果然实践诺言，面对楚军的进攻，命令自曹国后撤三舍，与宋、齐、秦三国军队一同驻扎在城濮（山东省范县南）。子玉率军急进，依托丘陵险阻扎营，两军对峙于城濮。晋文公退避三舍，既是报答以前楚成王给予的礼遇，也是运用"卑而骄之"、"怒而挠之"的诱敌之计，子玉再次上钩。
         * 　　楚子玉派大将斗勃向晋文公请战说："请与君之士戏，君凭轼而观之，得臣（子玉名）与寓目焉，"晋栾枝答词却相当谦恭："寡君闻命矣。楚君之惠，未之敢忘，是以在此。为大夫退，其敢当君乎？既不获命，敢烦大夫谓二三子：戒尔车乘，敬尔君事，诘朝相见。"
         * 　　城濮交战时双方的阵容是：晋三军，即先轸为元帅，统率中军，郤溱辅佐，狐毛统率上军，狐偃辅佐。栾枝统率下军，胥臣辅佐。楚国也是三军，即令尹子玉以若敖之六卒统率中军。子西（斗宜申）统率左军。子上（斗勃）统率右军。楚的仆从国郑、许军附属楚左军，陈、蔡军附属楚右军。
         * 　　四月六日，晋军在城濮严阵以待楚军。子玉狂傲声称："日必无晋矣。"当两军接触之时，晋下军佐胥臣率所部用虎皮蒙在马身上，首先冲击楚右翼的陈、蔡军，陈、蔡军惊骇逃散，楚右军溃败。楚子玉、子上见右军溃败，怒火中烧，加强对晋中军和上军的攻势。晋右翼上军狐毛设将、佐二面旗帜，令二旗后退，引诱楚军。晋下军栾枝所部也以车辆曳树枝奔驰而伪装后退。楚子玉以为晋右翼败退，令楚左军追击，所以对陈、蔡及右翼军溃败并未理会。楚左军追击晋上军时，侧翼暴露，晋先轸、郤溱率中军拦腰截击，狐毛、狐偃率上军夹攻楚左军，楚左军溃败。楚子玉见左、右军皆败，遂下令中军停止进攻，得以不败。子玉率残兵退出战场，晋军进占楚军营地，休整三日后，胜利班师。
         * 　　城濮一战使晋文公建立了霸权，楚国北进锋芒受到挫折，被迫退回桐柏山、大别山以南地区。中原诸侯无不朝宗晋国。
         * 　　在城濮之战中，宋、齐、秦的军队虽然到了城濮，但未参加实际战斗。晋国以战车七百乘、五万多兵力击败楚、陈、蔡、郑、许五国联军十余万众，是一次以少胜多的战役。（此处并无证据证明楚军真实兵力比晋国多。十余万仅是后人猜测，切尚有争议）晋国的胜利在于，认识到楚是强敌，君臣团结一心，在政治、外交、军事上，周密策划，牢牢掌握着战争的主动权，所以终于击败了楚国。楚国则不然。楚自战胜宋襄公以来，中原诸侯无一能敌，官兵上下已养成一片虚骄之气。子玉虽为一代枭将，不但不能革除积弊，反而更加骄狂。面对这样的大战，竟意气用事，掉以轻心，结果被人牵了鼻子，导致战争失败。楚成王得到楚军败报，派人指责子玉说："大夫若入，其若申息之老何？"子玉羞愤自杀。
         * 　　四月二十七日，晋军进入郑国衡雍（河南原阳县西，当时在黄河南岸），并在践土（距衡雍较近，当时亦在黄河南岸，在河南花园口黄河北岸）修筑王的行宫，向襄王献俘。周襄王策命晋文公为"侯伯"。晋文公要求诸侯"皆奖王室，无相害也。有渝此盟，明神殛之，无克祚国"。晋文公在"尊王"的旗帜下，顺理成章地登上了霸主宝座。
         */

        private String detail_url;
        private String name;
        private String army;
        private String result;
        private String time;
        private String address;
        private String figure;
        private String war_detail;

        public String getDetail_url() {
            return detail_url;
        }

        public void setDetail_url(String detail_url) {
            this.detail_url = detail_url;
        }

        public String getName() {
            return name;
        }

        public void setName(String name) {
            this.name = name;
        }

        public String getArmy() {
            return army;
        }

        public void setArmy(String army) {
            this.army = army;
        }

        public String getResult() {
            return result;
        }

        public void setResult(String result) {
            this.result = result;
        }

        public String getTime() {
            return time;
        }

        public void setTime(String time) {
            this.time = time;
        }

        public String getAddress() {
            return address;
        }

        public void setAddress(String address) {
            this.address = address;
        }

        public String getFigure() {
            return figure;
        }

        public void setFigure(String figure) {
            this.figure = figure;
        }

        public String getWar_detail() {
            return war_detail;
        }

        public void setWar_detail(String war_detail) {
            this.war_detail = war_detail;
        }
    }
}
