package com.hjianfei.museum_beacon_exhibition.bean;

import java.io.Serializable;

/**
 * Created by HJianFei on 2016/11/5.
 */

public class MuseumDetail implements Serializable {

    /**
     * museum_detail_name : 故宫博物院
     * museum_detail_content :         故宫博物院，是一座特殊的博物馆。
     * 　　成立于1925年的故宫博物院，建立在明清两朝皇宫——紫禁城的基础上。历经五百年兴衰荣辱，帝王宫殿的大门终于向公众敞开。
     * 　　故宫博物院绝无仅有的独特藏品，是世界上规模最大、保存最完整的紫禁城木结构宫殿建筑群。它是中华民族的骄傲所在，也是全人类的珍贵文化遗产。如今，昔日皇宫禁地那占地78万平方米的重重宫阙，既是收藏明清皇室珍宝的巨大宝库，也是记载明清宫廷历史的鲜活档案……因此，故宫博物院的生命线，就依附在紫禁城宫殿中，顺着它的文化脉络生长、延伸……
     * 　　走进故宫博物院，您沿中轴线前行，从起伏跌宕的建筑乐章中可以感受盛世皇朝的博大胸怀；可以透过东西六宫精巧的陈设和内廷园囿雅致的格局，捕捉宫廷生活的温婉气息；可以从养心殿东暖阁卷起的黄纱帘中，追溯百年前中华民族内忧外患的历史沧桑……
     * 　　然而，这并不是故宫博物院的全部。
     * 　　走过80个春秋的故宫博物院，不仅一如既往精心保管着明清时代遗留下来的皇家宫殿和旧藏珍宝，而且通过国家调拨、向社会征集和接受私人捐赠等方式，极大地丰富了文物藏品，形成古书画、古器物、宫廷文物、书籍档案等领域蔚成系列、总数超过180万件的珍贵馆藏。漫步在故宫博物院的常设文物专馆，或者欣赏频繁推出的专题文物展览，让您可以更完整地了解中华民族工艺美术的伟大成就。
     * 　　步入新世纪以来，故宫博物院开展了历史上规模最大的古建维修工程，在让古老的紫禁城焕发新生的同时，也向您生动地展示着弥足珍贵的传统建筑工艺。
     * 故宫博物院，是一座特殊的博物馆。
     * 　　成立于1925年的故宫博物院，建立在明清两朝皇宫——紫禁城的基础上。历经五百年兴衰荣辱，帝王宫殿的大门终于向公众敞开。
     * 　　故宫博物院绝无仅有的独特藏品，是世界上规模最大、保存最完整的紫禁城木结构宫殿建筑群。它是中华民族的骄傲所在，也是全人类的珍贵文化遗产。如今，昔日皇宫禁地那占地78万平方米的重重宫阙，既是收藏明清皇室珍宝的巨大宝库，也是记载明清宫廷历史的鲜活档案……因此，故宫博物院的生命线，就依附在紫禁城宫殿中，顺着它的文化脉络生长、延伸……
     * 　　走进故宫博物院，您沿中轴线前行，从起伏跌宕的建筑乐章中可以感受盛世皇朝的博大胸怀；可以透过东西六宫精巧的陈设和内廷园囿雅致的格局，捕捉宫廷生活的温婉气息；可以从养心殿东暖阁卷起的黄纱帘中，追溯百年前中华民族内忧外患的历史沧桑……
     * 　　然而，这并不是故宫博物院的全部。
     * 　　走过80个春秋的故宫博物院，不仅一如既往精心保管着明清时代遗留下来的皇家宫殿和旧藏珍宝，而且通过国家调拨、向社会征集和接受私人捐赠等方式，极大地丰富了文物藏品，形成古书画、古器物、宫廷文物、书籍档案等领域蔚成系列、总数超过180万件的珍贵馆藏。漫步在故宫博物院的常设文物专馆，或者欣赏频繁推出的专题文物展览，让您可以更完整地了解中华民族工艺美术的伟大成就。
     * 　　步入新世纪以来，故宫博物院开展了历史上规模最大的古建维修工程，在让古老的紫禁城焕发新生的同时，也向您生动地展示着弥足珍贵的传统建筑工艺。
     * 　　当前，故宫博物院的研究人员正在对古建筑、院藏文物、宫廷历史文化遗存、明清档案、清宫典籍和近80年的故宫博物院历程进行着更为深入细致的研究。建立起完整的“故宫学”体系，意在向您揭示紫禁城中蕴涵的博大精深的中华民族智慧和文化精神。
     * 　　曾经，受经济条件和技术手段的限制，故宫博物院和昔日殿宇重重的帝王宫殿一样，似乎总是蒙着神秘的面纱。但是，近10年来，步入信息化时代的故宫博物院，利用最先进的数字化技术和设备，在虚拟的时空中建立起一座和紫禁城同样辉煌的“数字故宫”。将紫禁城里取之不尽的文化资源奉献给远方的观众朋友，已经不再是遥远的梦想……
     * 　　我们希望通过开启故宫博物院网站这个与您互动的窗口，构建一个促进“故宫学”的发展的平台，欢迎您关注、监督并共同推进故宫博物院的发展……
     * 　　故宫博物院正以越来越开放的姿态，邀请您走进这片曾经神秘的领地，走进中华传统文化的圣殿。
     * 　　来源： http://www.dpm.org.cn/shtml/115/@/9036.html#21
     * museum_detail_imgs : http://images.quanjing.com/chineseview113/high/388-3022.jpg
     */

    private MuseumDetailBean museum_Detail;
    /**
     * museum_Detail : {"museum_detail_name":"故宫博物院","museum_detail_content":"        故宫博物院，是一座特殊的博物馆。\r\n　　成立于1925年的故宫博物院，建立在明清两朝皇宫\u2014\u2014紫禁城的基础上。历经五百年兴衰荣辱，帝王宫殿的大门终于向公众敞开。\r\n　　故宫博物院绝无仅有的独特藏品，是世界上规模最大、保存最完整的紫禁城木结构宫殿建筑群。它是中华民族的骄傲所在，也是全人类的珍贵文化遗产。如今，昔日皇宫禁地那占地78万平方米的重重宫阙，既是收藏明清皇室珍宝的巨大宝库，也是记载明清宫廷历史的鲜活档案\u2026\u2026因此，故宫博物院的生命线，就依附在紫禁城宫殿中，顺着它的文化脉络生长、延伸\u2026\u2026\r\n　　走进故宫博物院，您沿中轴线前行，从起伏跌宕的建筑乐章中可以感受盛世皇朝的博大胸怀；可以透过东西六宫精巧的陈设和内廷园囿雅致的格局，捕捉宫廷生活的温婉气息；可以从养心殿东暖阁卷起的黄纱帘中，追溯百年前中华民族内忧外患的历史沧桑\u2026\u2026\r\n　　然而，这并不是故宫博物院的全部。\r\n　　走过80个春秋的故宫博物院，不仅一如既往精心保管着明清时代遗留下来的皇家宫殿和旧藏珍宝，而且通过国家调拨、向社会征集和接受私人捐赠等方式，极大地丰富了文物藏品，形成古书画、古器物、宫廷文物、书籍档案等领域蔚成系列、总数超过180万件的珍贵馆藏。漫步在故宫博物院的常设文物专馆，或者欣赏频繁推出的专题文物展览，让您可以更完整地了解中华民族工艺美术的伟大成就。\r\n　　步入新世纪以来，故宫博物院开展了历史上规模最大的古建维修工程，在让古老的紫禁城焕发新生的同时，也向您生动地展示着弥足珍贵的传统建筑工艺。\r\n        故宫博物院，是一座特殊的博物馆。\r\n　　成立于1925年的故宫博物院，建立在明清两朝皇宫\u2014\u2014紫禁城的基础上。历经五百年兴衰荣辱，帝王宫殿的大门终于向公众敞开。\r\n　　故宫博物院绝无仅有的独特藏品，是世界上规模最大、保存最完整的紫禁城木结构宫殿建筑群。它是中华民族的骄傲所在，也是全人类的珍贵文化遗产。如今，昔日皇宫禁地那占地78万平方米的重重宫阙，既是收藏明清皇室珍宝的巨大宝库，也是记载明清宫廷历史的鲜活档案\u2026\u2026因此，故宫博物院的生命线，就依附在紫禁城宫殿中，顺着它的文化脉络生长、延伸\u2026\u2026\r\n　　走进故宫博物院，您沿中轴线前行，从起伏跌宕的建筑乐章中可以感受盛世皇朝的博大胸怀；可以透过东西六宫精巧的陈设和内廷园囿雅致的格局，捕捉宫廷生活的温婉气息；可以从养心殿东暖阁卷起的黄纱帘中，追溯百年前中华民族内忧外患的历史沧桑\u2026\u2026\r\n　　然而，这并不是故宫博物院的全部。\r\n　　走过80个春秋的故宫博物院，不仅一如既往精心保管着明清时代遗留下来的皇家宫殿和旧藏珍宝，而且通过国家调拨、向社会征集和接受私人捐赠等方式，极大地丰富了文物藏品，形成古书画、古器物、宫廷文物、书籍档案等领域蔚成系列、总数超过180万件的珍贵馆藏。漫步在故宫博物院的常设文物专馆，或者欣赏频繁推出的专题文物展览，让您可以更完整地了解中华民族工艺美术的伟大成就。\r\n　　步入新世纪以来，故宫博物院开展了历史上规模最大的古建维修工程，在让古老的紫禁城焕发新生的同时，也向您生动地展示着弥足珍贵的传统建筑工艺。\r\n　　当前，故宫博物院的研究人员正在对古建筑、院藏文物、宫廷历史文化遗存、明清档案、清宫典籍和近80年的故宫博物院历程进行着更为深入细致的研究。建立起完整的\u201c故宫学\u201d体系，意在向您揭示紫禁城中蕴涵的博大精深的中华民族智慧和文化精神。\r\n　　曾经，受经济条件和技术手段的限制，故宫博物院和昔日殿宇重重的帝王宫殿一样，似乎总是蒙着神秘的面纱。但是，近10年来，步入信息化时代的故宫博物院，利用最先进的数字化技术和设备，在虚拟的时空中建立起一座和紫禁城同样辉煌的\u201c数字故宫\u201d。将紫禁城里取之不尽的文化资源奉献给远方的观众朋友，已经不再是遥远的梦想\u2026\u2026\r\n　　我们希望通过开启故宫博物院网站这个与您互动的窗口，构建一个促进\u201c故宫学\u201d的发展的平台，欢迎您关注、监督并共同推进故宫博物院的发展\u2026\u2026\r\n　　故宫博物院正以越来越开放的姿态，邀请您走进这片曾经神秘的领地，走进中华传统文化的圣殿。\r\n　　来源： http://www.dpm.org.cn/shtml/115/@/9036.html#21","museum_detail_imgs":"http://images.quanjing.com/chineseview113/high/388-3022.jpg"}
     * status : 1
     */

    private String status;

    public MuseumDetailBean getMuseum_Detail() {
        return museum_Detail;
    }

    public void setMuseum_Detail(MuseumDetailBean museum_Detail) {
        this.museum_Detail = museum_Detail;
    }

    public String getStatus() {
        return status;
    }

    public void setStatus(String status) {
        this.status = status;
    }

    public static class MuseumDetailBean {
        private String museum_detail_name;
        private String museum_detail_content;
        private String museum_detail_imgs;

        public String getMuseum_detail_name() {
            return museum_detail_name;
        }

        public void setMuseum_detail_name(String museum_detail_name) {
            this.museum_detail_name = museum_detail_name;
        }

        public String getMuseum_detail_content() {
            return museum_detail_content;
        }

        public void setMuseum_detail_content(String museum_detail_content) {
            this.museum_detail_content = museum_detail_content;
        }

        public String getMuseum_detail_imgs() {
            return museum_detail_imgs;
        }

        public void setMuseum_detail_imgs(String museum_detail_imgs) {
            this.museum_detail_imgs = museum_detail_imgs;
        }

        @Override
        public String toString() {
            return "MuseumDetailBean{" +
                    "museum_detail_name='" + museum_detail_name + '\'' +
                    ", museum_detail_content='" + museum_detail_content + '\'' +
                    ", museum_detail_imgs='" + museum_detail_imgs + '\'' +
                    '}';
        }
    }

    @Override
    public String toString() {
        return "MuseumDetail{" +
                "museum_Detail=" + museum_Detail +
                ", status='" + status + '\'' +
                '}';
    }
}
